{"id":2251,"date":"2023-07-04T15:45:28","date_gmt":"2023-07-04T07:45:28","guid":{"rendered":"https:\/\/www.acclime.com\/?p=2251"},"modified":"2023-07-04T20:53:40","modified_gmt":"2023-07-04T12:53:40","slug":"why-expand-your-business-to-asia","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/insights\/why-expand-your-business-to-asia\/","title":{"rendered":"Why expand your business into Asia: Reasons &#038; opinions"},"content":{"rendered":"<p>Asia is home to over 4.7 billion people, making it the most populous continent on Earth, with approximately two-thirds of the world’s population.<\/p>\n<p>Asia is also the world’s largest economic region, accounting for around 40% of global output. More significantly, Asia is projected to account for 70% of global post-pandemic economic growth, <a href=\"https:\/\/www.imf.org\/en\/Blogs\/Articles\/2023\/05\/01\/asia-poised-to-drive-global-economic-growth-boosted-by-chinas-reopening\" target=\"_blank\" rel=\"noopener\">according to a 2023 report by the International Monetary Fund<\/a>. This far outpaces Asia’s Western counterparts.<\/p>\n<p>Other indicators are also positive: In the last few decades, Asia has experienced a tremendous technological boom, integration is on the rise, and the economies have become relatively stable.<\/p>\n<p>Accelerating economic growth and stability are two of the many reasons for business expansion in Asia. However, the region is not without challenges and it is important to consider the pros and cons of doing business in Asia before making any major decisions.<\/p>\n<h2>Spectacular economic growth<\/h2>\n<p>In the last 75 years, Asia has experienced spectacular economic growth and has become a breeding ground for fast-moving, innovative, and competitive businesses. Since 1960, Asia has become richer faster than any other region of the world.<\/p>\n<p>Of course, this growth has not occurred at the same pace throughout the continent. It started in the 1950s with the “Japanese economic miracle”; by the late 80s, there was talk of Japan’s economy surpassing the US. Next came the “Asian miracle” and the rise of the Four Asian Tigers: Hong Kong, Singapore, South Korea, and Taiwan. By the 21st century, these four had made it onto the World Bank’s list of high-income economies.<\/p>\n<p>More recently, China, India, Indonesia, Malaysia, Thailand, and Vietnam have become champions in growth, and once again there is talk of the US losing its spot as the biggest economy. Countries such as Cambodia, Myanmar, and Laos are now emerging as exciting growth opportunities in the near term.<\/p>\n<p>The majority of growth is predicted to come from China, India, and the ASEAN countries, and it will give rise to a shifting world order: Asian economies will become global leaders and project their governance models across the world.<\/p>\n<h2>Large and growing consumer markets<\/h2>\n<p>The vast populations in Asia provide huge consumer markets to companies, and many international businesses seek to expand into Asia simply because of the sheer scale. Decades of development and economic growth have lifted many millions of people from poverty into the global middle class. The result is that now more than half of all consumers in the world (2.2 billion of 4 billion, according to the Brookings Institution) are in Asia.<\/p>\n<p>The trend is upward. A 2021 report from the World Economic Forum found that Indonesia and the Philippines together will add over 100 million new consumers to the global economy by 2030. For global companies, there is more good news: Although Asian consumers tend to be very proud of their products and services, they love spending and are curious about foreign products and cultures, mainly Western.<\/p>\n<h2>Business-friendly environments<\/h2>\n<p>Asia in general has a very business-friendly environment, especially for foreign investors. Singapore, for instance, is consistently recognised among the world’s best places to do business and remains among the top choices for business investors. It offers low taxes for companies and easy setup for new businesses.<\/p>\n<p>Compared to other countries considered business hubs, Singapore offers one of the quickest and easiest business registration processes. A company can be registered within one day with a capital of just SGD 1.<\/p>\n<p>Hong Kong is similar to Singapore in terms of business advantages and ease of setting up and doing business. Foreign investors in Hong Kong have access to low taxation, and international corporations can expand their operations into other Asian economies by opening a branch in Hong Kong. Hong Kong has the added advantage of its connection to the vast Chinese market and preferential trade terms with China compared to other countries.<\/p>\n<p>In Malaysia, high-technology, manufacturing, biotechnology, and health services are among the favoured business sectors. They are encouraged by tax incentives for certain types of investments in the country. For instance, in 2019, the <a href=\"https:\/\/www.mida.gov.my\/home\/\" target=\"_blank\" rel=\"noopener\">Malaysian Investment Development Authority<\/a> (MIDA) announced that companies eligible for the government’s Principal Hub (PH) incentive could enjoy a 10% tax rate for their operations instead of 24%.<\/p>\n<p>In this way, Malaysia is attracting numerous investors to use the country as a base for conducting their regional or global businesses. In southern Malaysia, the state of Johor Bahru is positioning itself through tax and investment incentives as a low-cost middle and back-office location for firms in Singapore, which is linked by road and rail across the strait of Johor.<\/p>\n<p>Thailand supports foreign investors and businesses through its special investment policies focusing on free trade. The country gives special support to companies and activities that promote innovation and technology. In December 2019, Thailand’s <a href=\"https:\/\/www.boi.go.th\/en\/index\/\" target=\"_blank\" rel=\"noopener\">Board of Investment<\/a> (BOI) also issued new incentives to attract investments in the country’s <a href=\"https:\/\/www.aseanbriefing.com\/news\/thailand-eastern-economic-corridor\/\" target=\"_blank\" rel=\"noopener\">Eastern Economic Corridor<\/a> (EEC).<\/p>\n<p>Thailand’s EEC is a special development zone covering three provinces: Chonburi, Rayong, and Chachoengsao. This latest incentive package includes tax reductions and holidays, as well as an expansion to the type of activities that will be eligible for these incentives.<\/p>\n<p>The above are only a few examples, but overall the benefits of doing business in Asia include the following:<\/p>\n<ul>\n<li>Low corporate tax rates<\/li>\n<li>Comprehensive double tax treaty networks with countries in ASEAN and around the world<\/li>\n<li>Sensible employment law regimes allowing for appropriately qualified foreigners to work in Asia<\/li>\n<li>Good intellectual property protection<\/li>\n<li>One of the largest arbitration centres in the world, the Singapore International Arbitration Centre (SIAC)<\/li>\n<li>A comprehensive and highly sophisticated banking network<\/li>\n<li>Widely permitted 100% foreign business ownership<\/li>\n<li>Widely allowed share transfers and the issuance of new shares<\/li>\n<\/ul>\n<h2>Hub for startups<\/h2>\n<p>In the last few years, money has been pouring into Asia’s tech startup scene, and international startup investors continue to bet big on the region’s rapid growth, large consumer markets, and youthful customers.<\/p>\n<p>Cities like Singapore and Ho Chi Minh City are competing to become the next Silicon Valley, with their governments outperforming each other in offering investment incentives.<\/p>\n<p>For example, the Singapore government rolled out <a href=\"https:\/\/www.startupsg.net\/\" target=\"_blank\" rel=\"noopener\">Startup SG<\/a>, which is a one-stop source for entrepreneurs to gain access to loans, grants, funding, and capability enhancement. The seven pillars of Startup SG include:<\/p>\n<ul>\n<li>Startup SG Founder provides mentorship and a startup capital grant of SGD 30,000 to first-time entrepreneurs with innovative business ideas.<\/li>\n<li>Startup SG Tech provides early-stage funding for the commercialisation of proprietary technology.<\/li>\n<li>Startup SG Accelerator provides funding and non-financial support to incubators and accelerators in strategic growth sectors.<\/li>\n<li>Startup SG Equity aims to catalyse more investments into Singapore-based deep-tech startups, whereby the government co-invests with a third-party investor.<\/li>\n<li>Startup SG Loan provides government-backed loans to startups to catalyse their growth opportunities.<\/li>\n<li>Startup SG Talent offers various schemes to help startups to attract talent to Singapore.<\/li>\n<li>Startup SG Infrastructure provides startups with the spaces that they need to grow, experiment, and flourish.<\/li>\n<\/ul>\n<p>Vietnam, in turn, is a very young country. The median age in Vietnam is 31, with almost 70% of the population under 40. Since 2016, the government has been actively promoting the local tech industry through legislative measures.<\/p>\n<p>The Law on Technology Transfer makes it easier for local Vietnam startups to access tech from abroad. Decree 38-ND-CP provides additional legal protections to startups and allows increased access to state funding. Initiatives like these have resulted in Vietnam becoming home to as many as 3,000 startups, one of the largest startup ecosystems in Asia. In 2017, 92 firms secured deals worth a record USD 292 million, a 42% increase from 2016’s USD 205 million, according to Topica Founder Institute.<\/p>\n<p>Some of the programs include:<\/p>\n<ul>\n<li>SpeedUP is a VND 11.75 billion (USD 520,520) startup investment fund from Ho Chi Minh City’s Department of Science and Technology. The fund offers startups from VND 350 million (USD 15,500) to VND 1,282 billion (USD 56,792).<\/li>\n<li><a href=\"https:\/\/startupcity.vn\/\" target=\"_blank\" rel=\"noopener\">Startupcity.vn <\/a> is an online platform that shares details about startups and investors, and aims to connect investors with entrepreneurs.<\/li>\n<li>The Vietnam-Finland <a href=\"https:\/\/ipp.vn\/en\/\" target=\"_blank\" rel=\"noopener\">Innovation Partnership Programme<\/a> is financed jointly by both governments. The fund’s investments focus on innovative companies that are aiming for international growth.<\/li>\n<li>Saigon Silicon City Centre is a 52-hectare complex built to support tech-focused startups and international firms. It is expected to attract investments worth USD 1.5 billion by 2020.<\/li>\n<li>Mekong Business Initiative is a partnership program between the Asian Development Bank and the Government of Australia that focuses on alternative financing for Cambodia, Laos, Myanmar, and Vietnam, including venture capital, angel investments, and fintech.<\/li>\n<li>Mobile Applications Laboratory (mLab) East Asia was launched by Ho Chi Minh City and has an incubation program focusing on mentoring, training, access to equipment, and financing.<\/li>\n<li>National Technology Innovation Fund (NATIF) is a government agency and financial institution under Vietnam’s Ministry of Science and Technology that provides grants and preferential loans for R&amp;D, innovation, and technology transfer.<\/li>\n<li>The National Agency for Technology, Entrepreneurship, and Commercialisation Development (NATECD) provides training, mentorship, and financial aid to startups.<\/li>\n<\/ul>\n<h2>Rising tourism industry<\/h2>\n<p>Another reason for business expansion is the booming Asian tourism industry which tripled in size over the last two decades. The well-developed travel infrastructure and multiple destinations throughout the region have made the tourism industry a sector worthy of investment.<\/p>\n<p>Asia’s reputation as a destination of choice for the world’s holiday goers, boasting must-see historical attractions and idyllic natural landscapes, has attracted domestic and international tourists and contributed enormously to local economies. Although the pandemic hit the tourism sector hard in 2020, it has rebounded well in 2023 and indicators for 2024 are even more positive.<\/p>\n<h2>Tax incentives and special economic zones<\/h2>\n<p>Across the Asian region, governments have embraced incentives to attract new businesses to their countries. From tax holidays granted to companies that establish manufacturing operations to Special Economic Zones with incentives for all who set up a business there, governments have been very creative in promoting their value propositions.<\/p>\n<p>Examples are the tax holidays for car manufacturers in Thailand, investment incentives and tax holidays for oil refining and chemical manufacturers in Singapore, state of the art infrastructure and tax breaks in the Iskandar area in southern Malaysia, and reductions in tax rates on certain businesses that set up in Vietnam’s special economic zones.<\/p>\n<p>Other countries provide accelerated tax write-offs for various types of expenditure, particularly research and development, that draw innovative industries to their shores.<\/p>\n<p>Dedicated government bodies in each country oversee the tax incentive schemes, such as the <a href=\"https:\/\/www.edb.gov.sg\/\" target=\"_blank\" rel=\"noopener\">Economic Development Board<\/a> (EDB) in Singapore, the <a href=\"https:\/\/www.boi.go.th\/en\/index\/\" target=\"_blank\" rel=\"noopener\">Board of Investment<\/a> (BOI) in Thailand, and the <a href=\"https:\/\/www.mida.gov.my\/\" target=\"_blank\" rel=\"noopener\">Malaysian Investment Development Authority<\/a> (MIDA). Seeking guidance from a local corporate services firm will make navigating the incentives easier and more efficient.<\/p>\n<h2>Trade partnerships<\/h2>\n<p>The two main multilateral treaties that Asian countries are party to are the ASEAN trading block, which allows the movement of most goods and services amongst the 10 member countries at tariff rates of between 0% and 5%. There is also a Free Trade Agreement between ASEAN, Australia, and New Zealand, further enhancing the trade-free block in the region.<\/p>\n<p>The other more recent agreement is the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP). This agreement deals with small and medium enterprises accessing overseas markets cost effectively and tariff-free. Signatories in Asia to the CPTPP include Japan, Singapore, Vietnam, Malaysia, and Brunei. Also a part of the agreement are Australia, New Zealand, Canada, Mexico, Chile, and Peru.<\/p>\n<p>The agreement eliminates or reduces tariff and non-tariff barriers across goods and services trade and investment, to create new opportunities and benefits for businesses, workers, and consumers in the signatory countries. The agreement is designed to admit other countries on the basis that they agree to adhere to the high standards set out in the agreement.<\/p>\n<h2>Looking to take the next step towards expanding into Asia?<\/h2>\n<p>The above is by no means an exhaustive list of advantages of expanding into Asia. There are many additional nuances worth exploring depending on the market.<\/p>\n<p>Acclime advises investors in developed and developing Asia, with <a href=\"\/locations\/\">offices throughout the region<\/a>. Businesses interested in expanding into these markets can contact Acclime and consult with the regional experts who will help identify the advantages of investing in the current economic climate.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The accelerated economic growth and stability are one of the many reasons why you should consider Asia as your next opportunity to expand abroad.<\/p>\n","protected":false},"author":1,"featured_media":938,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[182],"tags":[431],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2251"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=2251"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2251\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/938"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=2251"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=2251"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=2251"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}