{"id":2396,"date":"2023-06-01T15:08:44","date_gmt":"2023-06-01T07:08:44","guid":{"rendered":"https:\/\/www.acclime.com\/?p=2396"},"modified":"2023-06-08T17:44:43","modified_gmt":"2023-06-08T09:44:43","slug":"ease-of-doing-business-in-asia-what-you-need-to-know","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/insights\/ease-of-doing-business-in-asia-what-you-need-to-know\/","title":{"rendered":"Ease of doing business in Asia: What you need to know for 2023"},"content":{"rendered":"<p>Governments and regulatory bodies in Asia are continually making amendments to promote a more business-friendly environment and attract foreign investment. So how has the ease of doing business in Asia changed in 2023? Several countries have implemented or plan to enact significant reforms to enhance the ease of doing business, promote economic growth, and increase foreign investment.<\/p>\n<p>This article will highlight some of the most significant business reforms taking place across Asia in 2023.<\/p>\n<div class=\"uk-alert\" style=\"padding: 30px 40px;\">\n<h3 class=\"uk-margin-remove-top\">Contents<\/h3>\n<ul class=\"uk-list uk-list-collapse uk-nav-default\">\n<li><a href=\"#part1\" uk-scroll=\"offset:100\">China<\/a><\/li>\n<li><a href=\"#part2\" uk-scroll=\"offset:100\">Hong Kong<\/a><\/li>\n<li><a href=\"#part3\" uk-scroll=\"offset:100\">India<\/a><\/li>\n<li><a href=\"#part4\" uk-scroll=\"offset:100\">Indonesia<\/a><\/li>\n<li><a href=\"#part5\" uk-scroll=\"offset:100\">Malaysia<\/a><\/li>\n<li><a href=\"#part6\" uk-scroll=\"offset:100\">Philippines<\/a><\/li>\n<li><a href=\"#part7\" uk-scroll=\"offset:100\">Singapore<\/a><\/li>\n<li><a href=\"#part8\" uk-scroll=\"offset:100\">Thailand<\/a><\/li>\n<li><a href=\"#part9\" uk-scroll=\"offset:100\">Vietnam<\/a><\/li>\n<\/ul>\n<\/div>\n<h2 id=\"part1\">China 🇨🇳<\/h2>\n<p class=\"uk-text-muted\">World Bank Ease of Doing Business in Asia ranking: 12th<br \/>\nGlobal ranking: 31st<\/p>\n<h3>E-invoicing in China<\/h3>\n<p>In December 2021, a pilot program for a fully digitalised VAT and proof-of-purchase form called <em>e-fapiao<\/em> was launched in select regions of China. The word <em>fapiao <\/em>is romanised from the ideogram 发票 and is the traditional Chinese legal proof of purchase for goods or services, i.e., a receipt. The pandemic lockdowns across China drove the need for a virtual, electronic version of the <em>fapiao<\/em>, hence the <em>e-fapiao<\/em>.<\/p>\n<p>The initial trial included Shanghai, Guangdong and Inner Mongolia. The <em>e-fapiao<\/em> rollout will continue to expand in 2023 to cover more taxpayers. By 2025, <em>e-fapiao<\/em> is expected to be completely accessible all around the country.<\/p>\n<p>The fully digitalised <em>e-fapiao<\/em> has the same legal effect and usage as the traditional paper <em>fapiao<\/em>. In addition to the environmental and cost-saving benefits of going paperless, it will offer businesses several other advantages. These include better integration with other electronic systems for accounting and reporting.<\/p>\n<p>From 20 January 2023 to 30 March 2023, the pilot program of issuing fully digitalised <em>e-fapiao<\/em> expanded to cover taxpayers in Shanghai, Chongqing, Qingdao, Dalian, Tianjin, Shaanxi, Henan, Jilin, Shenzhen, Ningbo, Fujian, and Yunnan.<\/p>\n<h3>Expanding the “encouraged industries” catalogue to boost foreign investment<\/h3>\n<p>The National Development and Reform Commission (NDRC) and the Ministry of Commerce (MOFCOM) introduced the Catalogue of Encouraged Industries for Foreign Investment (2022) on 1 January 2023. It replaces the 2020 version. The purpose of the document is to guide foreign investment and expertise into areas of the Chinese economy in need of development. Industries are placed into four categories of foreign investment: Encouraged, Permitted, Restricted and Prohibited.<\/p>\n<p>Encouraged industries are given favourable treatment, such as tax benefits, compared to those in the neural Permitted category. Foreign investment in Restricted industries is limited to minority shareholding in joint ventures, and it is completely forbidden in the Prohibited category.<\/p>\n<p>The updated catalogue includes additions and modifications that cover end product manufacturing, components and parts manufacturing, and raw materials manufacturing. In the services industry, foreign investment is encouraged in production-oriented services, such as R&amp;D and logistics. There are also regional catalogues to cater to the specific advantages of China’s central, western, and northwestern regions.<\/p>\n<p>Foreign investment is encouraged in the following sectors:<\/p>\n<ul>\n<li><strong>Healthcare<\/strong> – developing drugs for rare diseases and special drugs for children; manufacturing dental implant systems; production, research and development of therapeutic medical and health textiles; hearing aid and cochlear implant manufacturing; rehabilitation for autistic children<\/li>\n<li><strong>Sports<\/strong> – construction, operation, and management of fitness facilities; research and development of snow and ice heavy equipment; intelligent sports products and services.<\/li>\n<li><strong>Elderly care<\/strong> – research and development of smart healthcare products and elderly care-related services<\/li>\n<li><strong>Rural revitalisation<\/strong> – water-saving irrigation, rural environmental remediation, smart agriculture, rural tourism<\/li>\n<li><strong>Vocational education<\/strong> – non-academic language and art training<\/li>\n<\/ul>\n<p>Foreign-invested enterprises (FIEs) doing business in Encouraged industries are entitled to benefits such as tariff exemptions on imported equipment, access to preferential land prices, and reduced corporate income tax in the western regions and Hainan.<\/p>\n<h2 id=\"part2\">Hong Kong 🇭🇰<\/h2>\n<p class=\"uk-text-muted\">World Bank Ease of Doing Business in Asia ranking: 2nd<br \/>\nGlobal ranking: 3rd<\/p>\n<h3>New foreign-sourced income regime<\/h3>\n<p>Hong Kong introduced a new foreign-sourced income regime on 1 January 2023. The new regime replaces the existing offshore profits tax exemption and requires companies to pay tax on certain types of foreign-sourced income (interest, dividends, disposal gains, and intellectual property income).<\/p>\n<p>If an MNE satisfies the exemption requirements for specific types of income, specific foreign-sourced income received in Hong Kong will not be taxable. The requirements include:<\/p>\n<ul>\n<li>The economic substance requirement applies to interest, dividends, and disposal gains.<\/li>\n<li>The nexus requirement applies to IP income.<\/li>\n<li>The participation requirement applies to dividends and disposal gains.<\/li>\n<\/ul>\n<p>For more information, continue reading Acclime’s article on the <a href=\"https:\/\/hongkong.acclime.com\/news\/new-foreign-sourced-income-regime\/\" target=\"_blank\" rel=\"noopener\">new foreign-sourced regime<\/a>.<\/p>\n<h3>BVI companies Act<\/h3>\n<p>The British Virgin Islands (BVI) recently passed the BVI Business Companies (Amendment) Act, which introduced changes to the existing BVI Act. The changes came into effect on 1 January 2023 and apply to all BVI companies.<\/p>\n<p>Some of the key changes include:<\/p>\n<ul>\n<li>Annual financial return filing requirements<\/li>\n<li>A list of directors made available to the public<\/li>\n<li>Maintaining a register of persons with significant control of BVI companies<\/li>\n<li>Abolishing the bearer shares<\/li>\n<li>Changes to the strike-off regime<\/li>\n<li>New process for the restoration of dissolved companies<\/li>\n<\/ul>\n<p>For more information, please continue reading Acclime’s article on <a href=\"https:\/\/hongkong.acclime.com\/news\/bvi-business-companies-act-changes-coming-2023\/\" target=\"_blank\" rel=\"noopener\">Changes to the BVI Business Companies Act<\/a>.<\/p>\n<h2 id=\"part3\">India 🇮🇳<\/h2>\n<p class=\"uk-text-muted\">World Bank Ease of Doing Business in Asia ranking: 19th<br \/>\nGlobal ranking: 63nd<\/p>\n<h3>New foreign trade policy<\/h3>\n<p>India’s new Foreign Trade Policy 2023 was implemented on 1 April 2023 with the goal of raising India’s product and service exports to USD 2 trillion by 2030.<\/p>\n<p>The new policy intends to increase trade, support manufacturing, improve ease of doing business, establish export hubs, and make the Indian Rupee a worldwide currency, further accelerating India’s rise as the centre of the world’s trade.<\/p>\n<h3>Debt mutual funds<\/h3>\n<p>India has introduced new debt mutual fund rules starting from 1 April 2023. The new rules state that debt mutual fund investors will no longer qualify for the long-term capital gains (LTCG) tax break and will be subject to tax similarly to bank deposits. This will also apply to gold, international equity, and domestic equity funds of funds (FoFs).<\/p>\n<h2 id=\"part4\">Indonesia 🇮🇩<\/h2>\n<p class=\"uk-text-muted\">World Bank Ease of Doing Business in Asia ranking: 24th<br \/>\nGlobal ranking: 73rd<\/p>\n<h3>Tax incentives for investing in Nusantara<\/h3>\n<p>Nusantara is the new Indonesian capital scheduled for inauguration in 2024. The Indonesian government issued Government Regulation 12 of 2023 (GR 9\/2023) which announced several incentives to encourage investment in the development of the new city. The incentives include corporate tax exemptions, tax holidays, import tax exemptions, personal income tax exemptions for priority project investment, and the ability to hire foreign employees for up to 10 years.<\/p>\n<p>For domestic taxpayers who invest IDR 10 billion in the new capital city, the government will provide an exemption from corporate income tax of up to 100% for a period of between 10 and 30 years. The sectors of investment determine the period of the incentive.<\/p>\n<p>Businesses in the new capital city will be able to hire foreign employees for 10 years. The foreign employees can also obtain residency permits for 10 years, which can be extended depending on the employment contract terms. The employer is not required to pay into the Foreign Worker Compensation Fund, which normally requires a monthly payment of USD 100 to the Ministry of Manpower.<\/p>\n<p>The government is also providing investors with 95-year land use permits. These can be extended for another 95 years for a total of 190 years of land usage.<\/p>\n<h2 id=\"part5\">Malaysia 🇲🇾<\/h2>\n<p class=\"uk-text-muted\"><a href=\"https:\/\/archive.doingbusiness.org\/en\/rankings\" target=\"_blank\" rel=\"noopener\">World Bank Ease of Doing Business in Asia<\/a> ranking: 5th<br \/>\nGlobal ranking: 12th<\/p>\n<h3>Changes to corporate and individual taxes<\/h3>\n<p>The Malaysian government introduced changes to the corporate and individual tax regimes in the 2023 Budget, effective 1 January 2023.<\/p>\n<p>MSMEs (Micro, Small, and Medium Enterprises) are subject to a corporate income tax rate of 15% for the first RM 150,000 of chargeable income. MSMEs earning between RM 150,000 to RM 600,000 are subject to 17%, and those earning more than RM 600,000 are subject to 24%.<\/p>\n<p>Malaysia’s 2023 Budget proposes reductions to the individual income tax rates to the following chargeable incomes:<\/p>\n<div class=\"uk-overflow-auto\">\n<table class=\"uk-table uk-table-divider uk-table-striped uk-table-hover\">\n<thead>\n<tr>\n<th><strong>Chargeable income (RM)<\/strong><\/th>\n<th><strong>Current rate<\/strong><\/th>\n<th><strong>New proposed rate<\/strong><\/th>\n<\/tr>\n<\/thead>\n<tbody>\n<tr>\n<td>35,000 to 50,000<\/td>\n<td>8%<\/td>\n<td>6%<\/td>\n<\/tr>\n<tr>\n<td>50,001 to 70,000<\/td>\n<td>13%<\/td>\n<td>11%<\/td>\n<\/tr>\n<tr>\n<td>70,001 to 100,000<\/td>\n<td>21%<\/td>\n<td>19%<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<p>However, the government has suggested an increased rate for individuals earning more than RM 100,000:<\/p>\n<div class=\"uk-overflow-auto\">\n<table class=\"uk-table uk-table-divider uk-table-striped uk-table-hover\">\n<thead>\n<tr>\n<th><strong>Chargeable income (RM)<\/strong><\/th>\n<th><strong>Current rate<\/strong><\/th>\n<th><strong>New proposed rate<\/strong><\/th>\n<\/tr>\n<\/thead>\n<tbody>\n<tr>\n<td>100,001 to 250,000<\/td>\n<td>24%<\/td>\n<td>25%<\/td>\n<\/tr>\n<tr>\n<td>250,001 to 400,000<\/td>\n<td>24.5%<\/td>\n<td>25%<\/td>\n<\/tr>\n<tr>\n<td>400,001 to 600,000<\/td>\n<td>25%<\/td>\n<td>26%<\/td>\n<\/tr>\n<tr>\n<td>600,001 to 1 million<\/td>\n<td>26%<\/td>\n<td>28%<\/td>\n<\/tr>\n<tr>\n<td>1,000,001 to 2 million<\/td>\n<td>28%<\/td>\n<td>28%<\/td>\n<\/tr>\n<tr>\n<td>Over 2 million<\/td>\n<td>30%<\/td>\n<td>30%<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<p>The new income tax rates will take effect from YA 2023.<\/p>\n<h3>New foreign employee hiring requirements<\/h3>\n<p>New regulations have been implemented in Malaysia for hiring foreign employees, effective 1 January 2023.<\/p>\n<p>The new requirements include:<\/p>\n<ul>\n<li>The employer must receive approval from Malaysia’s Director General of Labour (DGL) before hiring foreign employees. This applies to all non-Malaysians and non-permanent residents who require a work permit.<\/li>\n<li>Employers must notify the DGL within 30 days of the end of a foreign employee’s employment due to termination, work permit expiration, repatriation, or any other reason. Additionally, if foreign employees resign or leave without notice, employers must notify the DGL within 14 days.<\/li>\n<\/ul>\n<p>Non-compliance with the new regulations may result in a penalty of up to RM 100,000, imprisonment for a maximum of five years, or both.<\/p>\n<h2 id=\"part6\">Philippines 🇵🇭<\/h2>\n<p class=\"uk-text-muted\">World Bank Ease of Doing Business in Asia ranking: 32nd<br \/>\nGlobal ranking: 95th<\/p>\n<h3>100% ownership of public services<\/h3>\n<p>On 21 March 2022, then-President Rodrigo Duterte approved Senate Bill (SB) 2094, which amended the Commonwealth Act No.146, also known as the <a href=\"https:\/\/philippines.acclime.com\/news\/foreign-ownership-public-services\/\" target=\"_blank\" rel=\"noopener\">Public Service Act<\/a>, allowing 100% foreign ownership of public services in the Philippines. However, the act was revised again in March 2023.<\/p>\n<p>Under the latest revision, beginning on 1 April 2023, 100% foreign ownership is allowed for services such as railways, airports, expressways, and telecommunications. Foreign ownership is limited to 40% of the following public utilities:<\/p>\n<ul>\n<li>Electricity distribution<\/li>\n<li>Electricity transmission<\/li>\n<li>Public utility vehicles<\/li>\n<li>Seaports<\/li>\n<li>Water pipeline distribution and sewerage<\/li>\n<\/ul>\n<p>The government now permits foreigners to wholly own domestic businesses (including micro-enterprises) and renewable energy projects.<\/p>\n<h2 id=\"part7\">Singapore 🇸🇬<\/h2>\n<p class=\"uk-text-muted\">World Bank Ease of Doing Business in Asia ranking: 1st<br \/>\nGlobal ranking: 2nd<\/p>\n<h3>Removal of e-meetings<\/h3>\n<p>From 1 July 2023, Singapore will no longer allow business entities to hold electronic meetings (e-meetings). This provision was put in place temporarily in 2020 to facilitate business continuity during the COVID-19 pandemic.<\/p>\n<p>The cancellation of the e-meeting provision could have diverse impacts on businesses. For example, they may be required to spend additional costs on travelling to physical meeting locations. The Accounting and Corporate Regulatory Authority (ACRA) and the Monetary Authority of Singapore (MAS) announced that they are working on changes that will allow businesses to still hold general meetings electronically after the provision is revoked.<\/p>\n<h3>Due diligence requirements for financial advisors<\/h3>\n<p>Under Notice SFA o4-N21, the MAS has added new due diligence requirements for corporate finance (CF) advisors operating in the city-state. Starting 1 October 2023, all corporate advisory engagements will be subject to the due diligence requirements.<\/p>\n<p>According to <a href=\"https:\/\/www.mas.gov.sg\/-\/media\/mas-media-library\/regulation\/notices\/cmg\/notice-sfa-04-n21\/cfnotice.pdf\" target=\"_blank\" rel=\"noopener\">Notice SFA o4-N21<\/a>, a CF advisor must conduct due diligence with reasonable care, skill, and diligence. The CF advisor must also ensure the listing applicant is informed of their duties and responsibilities under the Act.<\/p>\n<p>The CF advisor is essential in upholding these due diligence requirements, from confirming the accuracy of the data provided on the listing application to ensuring the listing application’s directors are qualified to run the company.<\/p>\n<h2 id=\"part8\">Thailand 🇹🇭<\/h2>\n<p class=\"uk-text-muted\">Ease of doing business in Asia ranking: 9th<br \/>\nGlobal ranking: 21st<\/p>\n<h3>Two shareholders are required (down from three)<\/h3>\n<p>The Civil and Commercial Code amendment (No.23), which reduced the minimum number of shareholders from three to two, was announced in the Royal Gazette on 8 November 2022 and went into effect on 7 February 2023.<\/p>\n<h2 id=\"part9\">Vietnam 🇻🇳<\/h2>\n<p class=\"uk-text-muted\">Ease of doing business in Asia ranking: 23rd<br \/>\nGlobal ranking: 70th<\/p>\n<h3>Tax deadlines extended<\/h3>\n<p>Businesses in Vietnam will receive tax extensions for VAT, corporate income tax, personal income tax, and land rent under Decree 12\/2023\/ND-CP.<\/p>\n<p>Most entities and individuals doing business in Vietnam are eligible for tax deadline extensions. The industries include:<\/p>\n<ul>\n<li>Accommodation and catering services<\/li>\n<li>Agriculture, forestry and fishery<\/li>\n<li>Beverage manufacturing<\/li>\n<li>Construction<\/li>\n<li>Drainage and wastewater treatment<\/li>\n<li>Education and training<\/li>\n<li>Food production and processing<\/li>\n<li>Health and social assistance activities<\/li>\n<li>Real estate business<\/li>\n<li>Warehousing transportation<\/li>\n<\/ul>\n<p>The new deadlines are as follows:<\/p>\n<h4>VAT<\/h4>\n<ul>\n<li>Monthly VAT declarations:\n<ul>\n<li>January to May 2023 – deadline extended by six months<\/li>\n<li>June – deadline extended by five months<\/li>\n<li>July – deadline extended by four months<\/li>\n<\/ul>\n<\/li>\n<li>Quarterly VAT declarations:\n<ul>\n<li>First quarter of 2023 – deadline extended by six months<\/li>\n<li>Second quarter of 2023 – deadline extended by five months<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h4>Corporate income tax<\/h4>\n<p>Corporate income tax due dates for the first and second quarters of 2023 will be extended three months from their original deadlines.<\/p>\n<h4>Personal income tax<\/h4>\n<p>Personal income tax for business households and individuals will be extended to 30 December 2023.<\/p>\n<h4>Land rent<\/h4>\n<p>The deadline for the first half of the land rent payment due in 2023 has been extended by six months from 31 May 2023.<\/p>\n<h2>Keep expanding your knowledge<\/h2>\n<p>This article is part of <a href=\"https:\/\/www.acclime.com\/category\/insights\/\">our Insights series<\/a> on doing business in Asia. The series covers the latest market trends and regulatory changes, so business leaders can make informed decisions.<\/p>\n<p>For a more comprehensive look at the countries discussed above, see our <a href=\"https:\/\/www.acclime.com\/insights\/emerging-markets-asia-guide\/\">guide to top emerging markets in Asia<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How has the ease of doing business in Asia changed in 2023? This guide highlights the key updates for business leaders and investors. <\/p>\n","protected":false},"author":1,"featured_media":987,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[182],"tags":[431],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2396"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=2396"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2396\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/987"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=2396"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=2396"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=2396"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}