{"id":2416,"date":"2020-09-08T11:15:02","date_gmt":"2020-09-08T04:15:02","guid":{"rendered":"https:\/\/www.acclime.com\/?p=2416"},"modified":"2023-10-30T12:51:11","modified_gmt":"2023-10-30T04:51:11","slug":"acclime-launches-its-cambodian-operation-with-the-acquisition-of-bse-accounting","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-launches-its-cambodian-operation-with-the-acquisition-of-bse-accounting\/","title":{"rendered":"Acclime launches its Cambodian operation with the acquisition of BSE Accounting"},"content":{"rendered":"<p class=\"uk-text-lead\"><strong>8 September 2020, Hong Kong<\/strong> – Acclime, the premier corporate services provider in Asia, announces today that it has completed the acquisition of BSE Accounting Co., Ltd (BSE) in Cambodia, with the firm soon to be rebranded to operate as Acclime Cambodia. With this latest acquisition, Acclime now has a solid presence across eight jurisdictions in Asia, including Cambodia, China, Hong Kong, Indonesia, Malaysia, Singapore, Thailand, and Vietnam, with around 300 professional staff.<\/p>\n<p>This acquisition extends Acclime’s capability to Cambodia. As a regional consulting and advisory firm, BSE serves a wide variety of local and international clients from industries as diverse as manufacturing, hotel &amp; restaurants, import &amp; export and retail. The firm offers a full range of services, including business management, market-entry advisory, HR, tax planning, accounting and outsourced bookkeeping and payroll.<\/p>\n<p>Along with San Rithy, Managing Director of BSE, the team of 50 professionals at BSE will join the Acclime family.<\/p>\n<p>“We are excited to be part of a regional network and look forward to be integrated under the Acclime brand,” San Rithy, Managing Director of BSE commented.  “Not only can our team get access to the expertise and resources of a well-established regional network, it will also benefit our clients who desire the same high standard of professional services in other Asian markets.”<\/p>\n<p>“It is a major milestone for Acclime to establish a presence in Cambodia, one of the most exciting emerging markets in Asia,” Martin Crawford, co-founder and CEO of Acclime remarked. “The country has an open foreign investment policy and with the introduction of new investment laws, it will certainly attract more foreign direct investment. Having a presence in this emerging market will not only strengthen our capabilities to assist clients navigating the complex regulatory landscape in Cambodia, but it will also solidify our presence in the country to support Cambodian clients wishing to expand regionally.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Acclime announces today that it has completed the acquisition of BSE Accounting Co., Ltd (BSE) in Cambodia, with the firm soon to be rebranded to operate as Acclime Cambodia.<\/p>\n","protected":false},"author":1,"featured_media":1965,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2416"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=2416"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2416\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/1965"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=2416"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=2416"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=2416"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}