{"id":2544,"date":"2020-11-02T11:00:53","date_gmt":"2020-11-02T04:00:53","guid":{"rendered":"https:\/\/www.acclime.com\/?p=2544"},"modified":"2023-10-30T12:50:52","modified_gmt":"2023-10-30T04:50:52","slug":"acclime-take5-people-partnership","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-take5-people-partnership\/","title":{"rendered":"Acclime partners with Take5 People to provide regional HR and payroll services"},"content":{"rendered":"<p>2 November 2020, Hong Kong – Acclime, the premier corporate services provider in Asia, is pleased to announce its partnership with Take5 People, a regional human resource management system (HRMS) solutions provider.<\/p>\n<p>As a regional expert provider of corporate services, Acclime makes everything seamless and simple, navigating turbulent changes in rules and conditions so our clients can focus on doing what they do best, advancing into Asia. We understand Asian markets and are equipped with years of in-country experience, critical and comprehensive grassroots knowledge to guide our clients, avoiding pitfalls and non-compliant in difficult-to-navigate markets in Asia and beyond.<\/p>\n<p>Take5 People focuses on digitalisation of human resource management and provides comprehensive HR and payroll solutions for clients. Making full use of the latest generation of internet and mobile technology, Take5 People has developed HR software solutions that are cross-regional, highly scalable and configurable to support all HR operational and compliance requirements.<\/p>\n<p>Through this partnership, Acclime can now provide clients with regional HR and payroll services powered by Take5 People’s comprehensive HR software solutions, including core HR, payroll and leave management, recruitment management, time and attendance, performance and training management, employee self-service and in-country payroll compliance. This collaboration covers Cambodia, China, Hong Kong, Indonesia, Macao, Malaysia, Singapore, Taiwan, Thailand, Vietnam and any other jurisdictions either party will expand into.<\/p>\n<p>“This is a perfect collaboration between two industry leaders, an absolute end-to-end service. The partnership will scale to greater heights and both will achieve great outcome together,” said Alan Ang, Group Commercial Director, Acclime.<\/p>\n<p>“It has always been Acclime’s aim to offer clients a seamless HR solution together with payroll services, no matter where they operate throughout the Asian region. We are extremely pleased with this partnership and we are confident that this collaboration will support our growth and expansion plans,” said Martin Crawford, co-founder and CEO of Acclime.<\/p>\n<p>&#8220;We are excited to be working with Acclime to provide customers with the highest quality human resources services and technology. This cooperation reinforces Take5 People&#8217;s ability to provide market leading cross-regional human resources management solutions,&#8221; Alsen Hsien, CEO Take5 People commented on this collaboration.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Acclime is pleased to announce its partnership with Take5 People, a regional human resource management system (HRMS) solutions provider.<\/p>\n","protected":false},"author":1,"featured_media":1962,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2544"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=2544"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2544\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/1962"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=2544"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=2544"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=2544"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}