{"id":2588,"date":"2020-11-11T10:46:20","date_gmt":"2020-11-11T03:46:20","guid":{"rendered":"https:\/\/www.acclime.com\/?p=2588"},"modified":"2023-10-30T12:50:16","modified_gmt":"2023-10-30T04:50:16","slug":"acclimes-third-acquisition-in-singapore","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclimes-third-acquisition-in-singapore\/","title":{"rendered":"Acclime’s third acquisition in Singapore expands expertise in BPO services for the maritime industry"},"content":{"rendered":"<p>11 November 2020, Hong Kong – Acclime, the premier corporate services provider in Asia, announces today that it has acquired a controlling stake in B P Solutions Pte Ltd (BPS), a Singapore-based corporate services firm. This is Acclime’s third acquisition in Singapore to expand its expertise in value-added finance projects such as business process outsourcing (BPO), with a focus on the maritime sector.<\/p>\n<p>Founded by Michel Noel and Ingi Ta in 2009, BPS specialises in designing, implementing and outsourcing back office solutions for shipping, ship management and maritime services companies with the goal to increase productivity and cost-efficiency. The firm also offers a full range of professional services such as ERP implementation, financial due diligence, accounting, payroll, tax compliance and other corporate services to global multinationals and SMEs in Singapore and Southeast Asia. A subsidiary office was set up in the Philippines in 2018 to support the growth of the firm.<\/p>\n<p>BPS will continue to operate as a separate brand, but to signify its relationship with Acclime, BPS will carry an endorsement ‘A Partner of Acclime’. Whilst Michel and Ingi will both join Acclime as partners; they will continue to run the daily operations of BPS.<\/p>\n<p>“We are delighted to be partnering with Acclime on our growth journey,” Michel Noel, Managing Director of BPS commented. “Being a part of Acclime’s regional network, we can now offer clients support and solutions in other emerging Asian markets.”<\/p>\n<p>“BPS presents a wonderful opportunity for Acclime to diversify our client base, strengthen our expertise and tap into the maritime industry, which contributes over 7% to Singapore&#8217;s GDP. We admired the comprehensive outsourcing back office solutions and the complex finance project expertise offered by BPS,” Martin Crawford, co-founder and CEO of Acclime commented. “It is our ambition to build similar solutions for our clientele in different industries in all of the Asian markets in which we operate.&#8221;<\/p>\n<p>In Singapore, Acclime has already built a strong foothold since January this year with the acquisition of Money Matters for Expats Pte Ltd and more recently, Jai Financial Pte Ltd. Both firms have already merged under the Acclime brand. The firm currently has over 40 professional staff in the country, providing corporate services to established multinationals and SMEs while supporting the growth and operation of start-ups.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>11 November 2020, Hong Kong – Acclime, the premier corporate services provider in Asia, announces today that it has acquired a controlling stake in B P Solutions Pte Ltd (BPS), a Singapore-based corporate services firm. This is Acclime’s third acquisition in Singapore to expand its expertise in value-added finance projects such as business process outsourcing [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2592,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2588"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=2588"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2588\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/2592"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=2588"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=2588"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=2588"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}