{"id":2616,"date":"2020-11-23T09:45:06","date_gmt":"2020-11-23T02:45:06","guid":{"rendered":"https:\/\/www.acclime.com\/?p=2616"},"modified":"2020-11-20T12:54:36","modified_gmt":"2020-11-20T05:54:36","slug":"acclime-acquires-domicile-corporate-services","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-acquires-domicile-corporate-services\/","title":{"rendered":"Acclime solidifies its presence in Vietnam with the rebranding of Domicile Corporate Services"},"content":{"rendered":"<p>23 November 2020, Hong Kong – Acclime, the premier corporate services provider in Asia, announces today that Domicile Corporate Services in Vietnam is rebranded to Acclime Vietnam. After partnering with Acclime for more than a year, Domicile Corporate Services is now fully integrating into Acclime. Acclime now has a presence across nine jurisdictions in Asia, including Cambodia, China, Hong Kong, Indonesia, Malaysia, Philippines, Singapore, Thailand, and Vietnam, with more than 350 professional staff.<\/p>\n<p>Domicile Corporate Services is a licensed provider of corporate compliance and outsourcing services in Vietnam. The range of corporate services provided by the firm includes accounting, taxation, payroll, company establishment, reporting and compliance. The firm has built a reputation for its focus on delivering quality outsourcing and consulting services to clients and assisting foreign-invested and locally owned companies in maintaining the highest level of professional standards in Vietnam through proactive compliance, reporting assistance and advice.<\/p>\n<p>Matthew Lourey, Managing Partner of Domicile Corporate Services, and a team of close to 70 will join the Acclime family. Matthew will continue to lead the team and assume the role as country head of Vietnam. <\/p>\n<p>“We are extremely excited to be rebranded and integrated to Acclime. We aim to continue to grow the Acclime brand name in Vietnam and the region,” Matthew Lourey, Managing Director of Acclime Vietnam commented. “We strive to improve our services to our clients from the standpoint of geographical coverage, technical knowledge and service contribution.” <\/p>\n<p>“This rebrand solidifies our market presence in Vietnam,” Martin Crawford, co-founder and CEO of Acclime remarked. “Despite the challenges and uncertainties due to the Covid-19 outbreak, Vietnam weathered the economic storm well and maintained its attraction as a bright spot for FDI. The country’s economy is one of only a few that has grown during the past year, and the growth is projected to continue on the back of interest by the international business community. The rebranding of Domicile to Acclime is an important step in offering our clients seamless service delivery in whichever market they work with us. This can be for foreign clients entering Vietnam or to support our Vietnamese clients who wish to expand regionally.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>23 November 2020, Hong Kong – Acclime, the premier corporate services provider in Asia, announces today that Domicile Corporate Services in Vietnam is rebranded to Acclime Vietnam. After partnering with Acclime for more than a year, Domicile Corporate Services is now fully integrating into Acclime. Acclime now has a presence across nine jurisdictions in Asia, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1707,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2616"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=2616"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2616\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/1707"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=2616"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=2616"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=2616"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}