{"id":2681,"date":"2020-12-21T07:00:57","date_gmt":"2020-12-21T00:00:57","guid":{"rendered":"https:\/\/www.acclime.com\/?p=2681"},"modified":"2020-12-18T11:43:48","modified_gmt":"2020-12-18T04:43:48","slug":"acclime-acquires-finex-corporation-vietnam","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-acquires-finex-corporation-vietnam\/","title":{"rendered":"Acclime doubles its presence in Vietnam with the acquisition of Finex Corporation"},"content":{"rendered":"<p>21 December 2020, Hong Kong – Acclime, the premier corporate services provider in Asia, announces today that it has completed the acquisition of Finex Corporation in Vietnam. With this new addition, the headcount of Acclime in Vietnam surpasses 100, doubling the size of Acclime&#8217;s business in the fast-growing Vietnamese market.<\/p>\n<p>Established in 2008, Finex started as an HR consultancy practice providing HR related services such as payroll, HR consultancy, recruitment, and staff outsourcing services to international clients operating in Vietnam. As the business grew, the scope of services expanded to include accounting, tax and compliance services.<\/p>\n<p>Betty Lim, the Founder and Director of Finex, and Kevin Lam, Director of Finex will join Acclime as Partners while continuing to be responsible for Finex’s client portfolio. The business will merge with Acclime&#8217;s existing Vietnam business early in 2021, in combined premises in both Ho Chi Minh City and Hanoi. Acclime also has an operational office in Danang.<\/p>\n<p>“This is a new chapter for all of us and we are thrilled to be part of a regional network, able to provide high-quality services in nine countries,” Betty commented. “I am excited that we can now support our clients who wish to expand their businesses to other Asian markets.”<\/p>\n<p>“Vietnam is a growth market for corporate services as foreign businesses continue to invest, attracted by the size and demographics of the country, the quality and availability of skilled resources, and the economic growth potential. Acclime&#8217;s role is to support such FDI clients by allowing them to outsource to us their legal, accounting and HR functions. The addition of Finex to Acclime gives us a substantial opportunity for Acclime to diversify our client base. We can now offer a broader spectrum of our service offerings, including full-fledged HR outsourcing,” Martin Crawford, co-founder and CEO of Acclime remarked. “Our clients can benefit from this one-stop solution, no matter where they operate inside Vietnam or indeed throughout the Asian region.”<\/p>\n<p>“Just last month, we fully rebranded Domicile Corporate Services to Acclime, after partnering with Acclime more than a year ago,” Matthew Lourey, Managing Director of Acclime Vietnam remarked. “We look forward to welcoming the Finex team to the firm and establishing Acclime as the pre-eminent service provider in the Vietnamese market.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>21 December 2020, Hong Kong – Acclime, the premier corporate services provider in Asia, announces today that it has completed the acquisition of Finex Corporation in Vietnam. With this new addition, the headcount of Acclime in Vietnam surpasses 100, doubling the size of Acclime&#8217;s business in the fast-growing Vietnamese market. Established in 2008, Finex started [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":1707,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2681"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=2681"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2681\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/1707"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=2681"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=2681"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=2681"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}