{"id":2772,"date":"2021-02-08T10:00:52","date_gmt":"2021-02-08T03:00:52","guid":{"rendered":"https:\/\/www.acclime.com\/?p=2772"},"modified":"2021-02-08T10:38:56","modified_gmt":"2021-02-08T03:38:56","slug":"acclime-acquires-1421-consulting-group","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-acquires-1421-consulting-group\/","title":{"rendered":"Acclime doubles its presence and service offering in China with the acquisition of 1421 Consulting Group"},"content":{"rendered":"<p>8 February 2021, Hong Kong – Acclime, the premier corporate services provider in Asia, announces today that it has completed the acquisition of 1421 Consulting Group in China. Acclime today has a presence in ten jurisdictions, including Cambodia, China, Philippines, Hong Kong, Indonesia, Malaysia, Netherland, Singapore, Thailand, and Vietnam, with more than 400 professional staff.<\/p>\n<p>Founded by Peter Pronk in 2011, 1421 Consulting Group specialises in supporting western companies, predominantly European, in setting up and growing their businesses in China. The firm offers high-end consulting services on all aspects of operating a business in China, from market-entry advice through to setting up corporate entities, finding distribution partners, visas and work permits, bookkeeping, compliance and tax services and market research. 1421 offers a one-stop solution to enterprises prior to and during their process of communicating and doing business with enterprises which do not share the same cultural background.<\/p>\n<p>The business will merge with Acclime’s existing China business, operating in Beijing and Shenzhen. 1421 Consulting has a Netherlands-based sales office which acts as a hub to guide clients who are based in Europe on how to set up and develop their businesses in China. This will be enhanced to support expansion into any of the ten Asian markets in which Acclime has a presence.<\/p>\n<p>The consulting services of 1421 will continue to operate as a separate brand, but to signify its relationship with Acclime, 1421 Consulting will carry an endorsement, ‘A Partner of Acclime’. Peter will join Acclime as a Brand Ambassador and will keep supporting its growth.<\/p>\n<p>“I am delighted to be partnering with Acclime on our growth journey,” Peter Pronk, Founder of 1421 Consulting Group commented. “Being a part of Acclime’s regional network, we can now offer clients support and solutions in ten countries.”<\/p>\n<p>“We are very pleased to be affiliated with 1421, which provides us with an extensive platform to further our services in the China market,” Martin Crawford, co-founder and CEO of Acclime remarked. China is the most desirable market for foreign trade and investment in the region. This strategic collaboration not only strengthens our abilities to support clients in the challenging regulatory environment in China but enhances our presence in the country to help Chinese clients who wish to expand globally.”<\/p>\n<p>Crawford noted that with the in-country expertise and technology used, Acclime is well-positioned to be the one-stop service provider for clients operating in and throughout the region who demand the highest international standards in the difficult to navigate emerging Asian markets.<\/p>\n<p>“We look forward to welcoming the 1421 team to the firm and establishing Acclime together in the Chinese market,” Maarten Roos, Managing Partner of Acclime China remarked. “Our team in China can now tap into the knowledge and resources of a well-established regional network”.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>8 February 2021, Hong Kong – Acclime, the premier corporate services provider in Asia, announces today that it has completed the acquisition of 1421 Consulting Group in China. Acclime today has a presence in ten jurisdictions, including Cambodia, China, Philippines, Hong Kong, Indonesia, Malaysia, Netherland, Singapore, Thailand, and Vietnam, with more than 400 professional staff. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2787,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2772"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=2772"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2772\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/2787"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=2772"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=2772"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=2772"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}