{"id":2907,"date":"2021-03-01T09:11:20","date_gmt":"2021-03-01T02:11:20","guid":{"rendered":"https:\/\/www.acclime.com\/?p=2907"},"modified":"2023-10-30T12:49:33","modified_gmt":"2023-10-30T04:49:33","slug":"cosec-corporate-services-acquisition","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/cosec-corporate-services-acquisition\/","title":{"rendered":"Acclime establishes a strong foothold in Australia with the acquisition of CoSec Corporate Services"},"content":{"rendered":"<p>1 March 2021, Hong Kong – Acclime, the premier corporate services provider in Asia, is pleased to announce that it has completed the acquisition of CoSec Corporate Services, a highly regarded firm specialising in assisting foreign clients enter and operate in Australia. With this acquisition, in addition to the presence in nine key Asian jurisdictions and a European sales office in the Netherlands, Acclime’s footprint now extends into Australia, with additional sales offices in the United States of America and the United Kingdom.<\/p>\n<p>Founded by Blair Lucas and Paul Dixon in 2011, CoSec offers clients entering and operating in Australia a full suite of incorporation, hosting and compliance services under one roof. The firm has extensive experience in assisting life science companies looking to conduct clinical trials in Australia and take advantage of the government’s 43.5% R&amp;D incentive program. CoSec also works with foreign companies in various industries that wish to establish a presence in the lucrative Australian market. The firm’s service package covers market entry assistance, incorporation, and all ongoing accounting, payroll, and tax compliance services necessary to maintain a compliant entity.<\/p>\n<p>“This is the logical next step for CoSec and presents a strategic opportunity to be part of a larger international team with established resources and networks across Acclime’s established Asian portfolio,” Blair Lucas, Co-founder and Chief Executive Officer of CoSec said. “We are excited at the opportunities that lay ahead and the value we can deliver to Acclime’s clients through our presence and deep understanding of the Australian, US and UK markets.”<\/p>\n<p>“Each market has its own complex corporate and compliance regimes which are difficult to navigate for companies who are looking to expand into new regions,” Paul Dixon, Co-founder and Chief Financial Officer of CoSec said. “As a result of this strategic integration, our clients can benefit from a wider spectrum of professional services and gain access to regional experts to help them navigate complex emerging Asian markets.”<\/p>\n<p>“Australia is a trading nation and a high-growth destination for foreign investment. Twelve of its 15 largest markets are in Asia and Oceania, showing how integrated Australia’s economy is with the Asian neighbours,” Martin Crawford, Co-founder and CEO of Acclime said. “With our expansion plan, having a strong footprint in Australia &#8211; an integral and desirable market in the Asia-Pacific region &#8211; is critical. CoSec fits perfectly with what we do at Acclime &#8211; assisting clients to expand and succeed in whichever Asian market they choose to enter and operate within.&#8221;<\/p>\n<p>CoSec will formally transition to the Acclime brand on 1 June 2021.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>1 March 2021, Hong Kong – Acclime, the premier corporate services provider in Asia, is pleased to announce that it has completed the acquisition of CoSec Corporate Services, a highly regarded firm specialising in assisting foreign clients enter and operate in Australia. With this acquisition, in addition to the presence in nine key Asian jurisdictions [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2920,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2907"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=2907"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/2907\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/2920"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=2907"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=2907"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=2907"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}