{"id":3518,"date":"2021-06-01T03:00:30","date_gmt":"2021-05-31T20:00:30","guid":{"rendered":"https:\/\/www.acclime.com\/?p=3518"},"modified":"2021-06-11T09:29:38","modified_gmt":"2021-06-11T02:29:38","slug":"acclime-rebrands-cosec","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-rebrands-cosec\/","title":{"rendered":"Acclime consolidates its expansion to Australia with the rebranding of CoSec Corporate Services"},"content":{"rendered":"<p>1 June 2021, Hong Kong – Acclime, the premier corporate services provider in Asia, is pleased to announce today that its Australian subsidiary, CoSec Corporate Services, has completed its integration into the Acclime group of companies. Following the acquisition by Acclime earlier this year, CoSec Corporate Services has now fully rebranded to Acclime Australia. In addition to its presence in nine key Asian jurisdictions and a European sales office in the Netherlands, Acclime’s footprint now extends into Australia, with additional sales offices in San Francisco and Denver in the United States of America.<\/p>\n<p>Founded by Blair Lucas and Paul Dixon in 2011, CoSec Corporate Services offers clients entering and operating in Australia and the USA a full suite of incorporation and ongoing corporate compliance, accounting, and tax services. The firm has extensive experience in assisting companies from across a wide variety of industry sectors, including life sciences, fintech, agtech and energy, to enter the lucrative Australian market. Since founding, CoSec has supported more than 500 companies from 38 countries to expand their operations into Australia.<\/p>\n<p>Blair Lucas and Paul Dixon will continue to lead the Australia team within the Acclime family as CEO and CFO respectively and have both become Acclime Partners.<\/p>\n<p>Martin Crawford, Co-founder and CEO of Acclime said “The Australian economy is inextricably linked to its Asian neighbours, being both a growing destination for foreign investment from the region and an exporter of goods and services to the region. At Acclime, we regard our presence in Australia as critical in promoting our mission to assist our clients expand and succeed in any market of choice across the Asia-Pacific region.”<\/p>\n<p>“We are excited and delighted to become an integral part of a large international team with established resources across Acclime’s network,” Blair Lucas, CEO of Acclime Australia said. “We are confident we can provide even greater value to our existing clients, and we are looking forward to extending our services and expertise in the Australian and US markets to Acclime’s clients throughout Asia.”<\/p>\n<p>“We are acutely aware of the challenges facing companies looking to expand into new markets, and we specialise in providing tailored support to assist companies in navigating complex compliance regimes,” Paul Dixon, CFO of Acclime Australia said. “This tight integration with the rest of the Acclime family means that our clients have even greater access to experts across Asia to assist in expansion.”<\/p>\n<p>The rebranding of CoSec as Acclime Australia is now effective and information regarding its services, team and reach can be found at <a href=\"https:\/\/australia.acclime.com\" target=\"_blank\" rel=\"noopener\">australia.acclime.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>1 June 2021, Hong Kong – Acclime, the premier corporate services provider in Asia, is pleased to announce today that its Australian subsidiary, CoSec Corporate Services, has completed its integration into the Acclime group of companies. Following the acquisition by Acclime earlier this year, CoSec Corporate Services has now fully rebranded to Acclime Australia. In [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3523,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3518"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=3518"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3518\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/3523"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=3518"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=3518"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=3518"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}