{"id":3554,"date":"2021-06-04T08:03:16","date_gmt":"2021-06-04T01:03:16","guid":{"rendered":"https:\/\/www.acclime.com\/?p=3554"},"modified":"2021-06-04T08:12:32","modified_gmt":"2021-06-04T01:12:32","slug":"acclime-takes-over-nvm-group","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-takes-over-nvm-group\/","title":{"rendered":"Acclime takes over clients of NVM Group in Vietnam, Cambodia and Myanmar for employee hosting, payroll and HR services"},"content":{"rendered":"<p>3 June 2021, Hong Kong – Acclime, the premier corporate services provider in Asia, is pleased to announce the takeover of clients and staff of NVM Group through a transfer agreement. The arrangement, which sees 18 of NVM’s clients consensually move to Acclime Vietnam and NVM’s Vietnam staff move into Acclime Vietnam’s new Ho Chi Minh City offices, came into effect on June 1st.<\/p>\n<p>NVM Group specialised in HR services, payroll outsourcing and employee hosting (sometimes referred to as PEO (Principal Employment Organisation) or EOR (Employer of Record) services) in Vietnam, Cambodia and Myanmar. When faced with the need to transfer existing clients to a trusted firm, as well as find a new home and career path for its loyal staff, NVM’s owner, Mr Quan Huynh, had only one corporate services provider in mind – Acclime. The entire transfer project was completed in only one month, ensuring a seamless transition for clients and their employees.<\/p>\n<p>PEO is a highly convenient way for a foreign-owned company to get started in a country before they have set up their own subsidiary or branch office and obtained the relevant permits, bank accounts, compliance staff and so on. Many clients find this arrangement so convenient, they never ‘in-source’ the employees, but continue to use the PEO provider after establishment.<\/p>\n<p>Acclime’s footprint across Asia includes fully owned subsidiaries in Vietnam and Cambodia and a strong affiliate partner in Myanmar, meaning the geographical fit with NVM Group was good. In addition, Acclime, via the Asian subsidiaries that have joined the group, has been providing HR outsourcing, payroll and PEO services to clients for over 10 years. Acclime specialises in providing premier corporate services to foreign companies expanding to Asian markets through expertise in navigating the complexities of compliance regulations.<\/p>\n<p>“We are delighted to welcome and serve NVM Group’s clients and their employees.” Matthew Lourey, Managing Partner of Acclime Vietnam said “It is exciting to bring about a transaction like this, bringing into our Vietnam operations the NVM team and clients, especially as the professional and international nature of the staff and clients of NVM matches very well with the culture that we all live at Acclime.”<\/p>\n<p>“When NVM considered options for selling its Outsourced Employment Services business, we had no hesitation in choosing Acclime by reason of the trust they have built in the industry, and I believe that their service standards are second to none in Vietnam,” Mr Quan Huynh, owner of NVM said. “After nearly 18 years of operations, NVM Group is pleased to divest its businesses in Vietnam, Cambodia and Myanmar to Acclime &#8211; the fast growing corporate services company in Asia. Knowing that our clients and staff would be exceedingly well looked after by Acclime was a major factor in the decision.”<\/p>\n<p>Details of Acclime Vietnam’s services and leadership team and can be found at <a href=\"https:\/\/vietnam.acclime.com\/news-insights\/quarterly-vietnam-hr-payroll-updates-april-2021\/\" target=\"_blank\" rel=\"noopener\">vietnam.acclime.com<\/a> and Acclime Cambodia’s at <a href=\"https:\/\/cambodia.acclime.com\/\" target=\"_blank\" rel=\"noopener\">cambodia.acclime.com<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Under agreement, NVM Group’s clients consensually move to Acclime Vietnam and NVM’s Vietnam staff move into Acclime&#8217;s offices.<\/p>\n","protected":false},"author":1,"featured_media":2821,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3554"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=3554"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3554\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/2821"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=3554"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=3554"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=3554"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}