{"id":3573,"date":"2021-06-23T11:17:54","date_gmt":"2021-06-23T04:17:54","guid":{"rendered":"https:\/\/www.acclime.com\/?p=3573"},"modified":"2021-06-23T13:24:01","modified_gmt":"2021-06-23T06:24:01","slug":"asia-growing-fdi-trend","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/insights\/asia-growing-fdi-trend\/","title":{"rendered":"Acclime at the heart of the growing FDI trend in resilient Asian countries"},"content":{"rendered":"<p>Acclime specialises in providing services to facilitate foreign direct investment (FDI), especially in Asia where we have a strong presence across the region. As a corporate services specialist positioned to assist with FDI in Asia, we bring you some of the Asia highlights from UNCTAD’s <a href=\"https:\/\/unctad.org\/system\/files\/official-document\/wir2021_en.pdf\" target=\"_blank\" rel=\"noopener\">World Investment Report 2021<\/a> which was published on June 21, 2021.<\/p>\n<p>Foreign direct investment (FDI) flows to developing countries in Asia increased by 4% to $535 billion in 2020, reflecting resilience amid global FDI contraction, according to the report.<\/p>\n<p>“Despite the pandemic, FDI to and from the region remained resilient in 2020. Developing Asia is the only region recording FDI growth, accounting for more than half of global inward and outward FDI flows,” said UNCTAD’s director of investment and enterprise, James Zhan.<\/p>\n<p>“FDI prospects in 2021 for Asia are more favourable than the global average, because of recovery in trade, manufacturing activities and a strong GDP growth forecast,” he added.<\/p>\n<h2>More than half of global flows<\/h2>\n<p>The region, already the world’s largest FDI recipient in 2019, received more than half of global FDI. Growth was driven by China, Hong Kong (China), India and the United Arab Emirates. Elsewhere in the region, FDI contracted. In economies where FDI is concentrated in tourism or manufacturing, contractions were particularly severe.<\/p>\n<p><a href=\"\/wp-content\/uploads\/unctadfig1-2.jpg\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig1-2.jpg\" alt=\"UNCTAD Global FDI inflow 2020 graph\" width=\"1000\" height=\"669\" class=\"alignnone size-full wp-image-3586\" srcset=\"https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig1-2.jpg 1000w, https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig1-2-300x201.jpg 300w, https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig1-2-768x514.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/a><\/p>\n<h3>East Asia<\/h3>\n<p>Flows to East Asia rose by 21% to $292 billion, inflated by the FDI recovery in Hong Kong (China), which surged by 62% (to $119 billion), after a sharp fall of FDI in 2019 and due to corporate reconfigurations by multinational enterprises (MNEs) headquartered in the economy.<\/p>\n<p>In China, FDI growth picked up pace in 2020 (growing by 6% to $149 billion), reflecting the country’s success in containing the pandemic and its rapid GDP growth recovery. The growth was driven by technology-related industries, e-commerce and research and development.<\/p>\n<p>In the Republic of Korea, FDI declined by 4% to $9 billion. Though the country was among the earliest to contain the COVID-19 outbreak and economic growth remained strong, a large drop in cross-border mergers and acquisitions (M&amp;As) due to large divestments led to a decline in investment.<\/p>\n<h3>South-East Asia<\/h3>\n<p>South-East Asia, an engine of global FDI growth for the past decade, recorded a 25% FDI contraction to $136 billion.<\/p>\n<p>Singapore, Indonesia and Viet Nam, the region’s largest FDI recipients in that order, all recorded FDI declines. FDI to Singapore fell by 21% to $91 billion, to Indonesia by 22% to $19 billion, and to Viet Nam by 2% to $16 billion.<\/p>\n<p>Lockdown measures, successive waves of COVID-19 infection, supply chain disruption, falling corporate earnings, economic uncertainties and delayed investment plans were key reasons for the contraction.<\/p>\n<p>In Thailand, FDI sank to -$6 billion, driven by the divestment of Tesco (United Kingdom) to a Thai investor group for $10 billion. In Malaysia, FDI fell by 55% to $3 billion. FDI in Cambodia was flat at $3.6 billion thanks to inflows in finance. In Myanmar, FDI dropped 34% to $1.8 billion.<\/p>\n<h3>South Asia<\/h3>\n<p>FDI in South Asia rose by 20% to $71 billion, driven mainly by a 27% rise in FDI in India to $64 billion.<\/p>\n<p>In India, robust investment in ICT and construction bolstered FDI inflows. Cross-border M&amp;As surged 83% to $27 billion, with major deals involving ICT, health, infrastructure and energy.<\/p>\n<p>FDI fell in other South Asian economies that rely on export-oriented garment manufacturing. Inflows in Bangladesh and Sri Lanka contracted by 11% and 43% respectively. In Pakistan, FDI was down by 6% to $2.1 billion, cushioned by continued investments in power generation and telecommunication industries.<\/p>\n<p><a href=\"\/wp-content\/uploads\/unctadfig2-1.jpg\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig2-1.jpg\" alt=\"UNCTAD FDI inflow graph 2020 Asia\" width=\"1000\" height=\"1000\" class=\"alignnone size-full wp-image-3588\" srcset=\"https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig2-1.jpg 1000w, https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig2-1-300x300.jpg 300w, https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig2-1-150x150.jpg 150w, https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig2-1-768x768.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/a><\/p>\n<h2>Outflows<\/h2>\n<p>Outward FDI (OFDI) from Asia increased by 7% to $389 billion – again, the only region recording expansion in outflows. This underscores the region’s prominence as an important investor for the developing region.<\/p>\n<p>The growth was driven by strong investment from Hong Kong (China) and Thailand. China, the largest investor country in 2020, saw OFDI stabilizing at $133 billion. The country’s tighter screening of OFDI, added to heightened scrutiny by the United States of investments originating from China, weighed on the country’s OFDI since 2017.<\/p>\n<p>Continued expansion of Chinese MNEs and active M&amp;A purchases abroad underpinned the stabilization in 2020.<\/p>\n<p><a href=\"\/wp-content\/uploads\/unctadfig3-1.jpg\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig3-1.jpg\" alt=\"UNCTAD FDI outflow graph 2020 Asia\" width=\"1000\" height=\"1116\" class=\"alignnone size-full wp-image-3589\" srcset=\"https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig3-1.jpg 1000w, https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig3-1-269x300.jpg 269w, https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig3-1-918x1024.jpg 918w, https:\/\/www.acclime.com\/wp-content\/uploads\/unctadfig3-1-768x857.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/a><\/p>\n<h2>Prospects<\/h2>\n<p>FDI prospects for the region are more favourable than the global outlook, with a projected growth of 5% to 10%, thanks to resilient intraregional value chains and strong economic growth prospects. Signs of trade and industrial production recovering in the second half of 2020 provide a strong foundation for FDI growth in 2021.<\/p>\n<p>Manufacturing, an important FDI sector for the region, already showed signs of recovery in the second half of 2020. However, in smaller economies oriented towards services and labour-intensive industries, particularly hospitality, tourism and garments, FDI could decline further in 2021.<\/p>\n<p>Acclime’s professional team of analysts and financial experts are in-country across Asia to continually assess the FDI outlook and keep a keen eye on any regulatory changes. We are committed to growing our presence in Asian markets through providing premier corporate services across a wide range of industries. We welcome you to reach out to us to see how our team can help facilitate your business growth and expansion.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We bring you some of the Asia FDI highlights from UNCTAD’s World Investment Report 2021 which was published on June 21, 2021.<\/p>\n","protected":false},"author":1,"featured_media":2790,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[182],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3573"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=3573"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3573\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/2790"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=3573"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=3573"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=3573"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}