{"id":3611,"date":"2021-07-08T14:16:16","date_gmt":"2021-07-08T07:16:16","guid":{"rendered":"https:\/\/www.acclime.com\/?p=3611"},"modified":"2021-07-08T15:06:47","modified_gmt":"2021-07-08T08:06:47","slug":"acclime-hong-kong-amalgamation","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-hong-kong-amalgamation\/","title":{"rendered":"Acclime amalgamates six licensed corporate services companies in Hong Kong to solidify its brand"},"content":{"rendered":"<p>7July 2021, Hong Kong – Acclime, the premier corporate services provider in Asia, is pleased to announce that, with effect from 1 July 2021, Ander Consulting (HK) Limited (Ander), BPO Global Services Limited (BPO), Edtoma Corporate Services Limited (Edtoma), Macaw Corporate Services Limited (Macaw) and WHA Services Limited (WHA) have been integrated with Acclime Corporate Services Limited (Acclime) by way of amalgamation.<\/p>\n<p>All six of these Hong Kong based companies have operated as one team during the last two years since they became part of Acclime and clients have responded positively to the combined service offerings. However, until now, the acquired businesses have traded as separate legal entities, under independent licenses from the Trust and Companies Services Provider (TCSP) licensing regime operated by the Hong Kong Companies Registry. The successful completion of the amalgamation means that the 40 employees in Acclime Hong Kong can now operate in Hong Kong as one business and one brand, allowing for increased efficiency in performance and operational control.<\/p>\n<p>Amalgamation of these six Hong Kong companies was important for Acclime to achieve, as it demonstrates Acclime’s focus on full integration of new firms it acquires. However, legal amalgamation is uncommon in Hong Kong as it is not a simple administrative process. The TCSP licensing regime has only been operating in Hong Kong since 2018, and the Companies Registry had never been faced with an amalgamation of six TCSP licensed companies before. Having led this ground breaking amalgamation, Acclime is now even better placed to apply its expertise in assisting clients with their amalgamations and corporate restructurings, especially in respect to obtaining tax clearance from the Inland Revenue.<\/p>\n<p>Acclime is proud of the way it has achieved a full integration of its Hong Kong acquisitions through a responsible and professional amalgamation. The Acclime brand is now fully represented in Hong Kong as the group continues to grow its presence throughout Asia-Pacific.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The amalgamation of six corporate services companies means that Acclime Hong Kong can now operate as one business and one brand.<\/p>\n","protected":false},"author":1,"featured_media":3614,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3611"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=3611"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3611\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/3614"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=3611"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=3611"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=3611"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}