{"id":3703,"date":"2021-09-27T16:00:07","date_gmt":"2021-09-27T09:00:07","guid":{"rendered":"https:\/\/www.acclime.com\/?p=3703"},"modified":"2021-09-27T16:11:54","modified_gmt":"2021-09-27T09:11:54","slug":"lehmanbrown-merger","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/lehmanbrown-merger\/","title":{"rendered":"Acclime expands in China with LehmanBrown merger"},"content":{"rendered":"<p>27 September 2021, Hong Kong – Acclime, the premier corporate services provider in Asia, announces today that it has completed a merger with LehmanBrown International Accountants in China. This is in line with Acclime’s strategy of actively growing its pipeline of compliance and corporate services businesses to be a major player in the region and a leader in the PRC market. This move brings Acclime’s headcount in China to over 200, and close to 700 across the whole group.<\/p>\n<p>LehmanBrown International Accountants has been a pioneer in assisting foreign organisations enter the China market for the last 20 years and has built up an enviable reputation. The company is now in a prime position to transition to a large-scale professional services firm so that it continues to attract the best talent, provides clients with access to a pan-Asian network and secures the business moving forward.<\/p>\n<p>“Acclime chose to partner with LehmanBrown because of the similarities in our cultural and professional styles – we have a similar DNA” remarked Martin Crawford, Co-founder and CEO of Acclime. “Both companies place significant value on genuine, collaborative partnerships with clients seeking to establish and expand into new markets. We believe LehmanBrown‘s clients will benefit from access to Acclime’s network of client services across Asia, including Greater China, Australia, Singapore, Vietnam, Indonesia, Thailand, Cambodia, Malaysia and Philippines.”<\/p>\n<p>LehmanBrown’s clients will continue to receive the same dedicated service from the same expert team, with access to deeper resources and regional experts who can help navigate complex Asian markets. Managing Partner of LehmanBrown, Russell Brown OBE, on making the announcement said “this is exciting news for everyone and a great time to pause and acknowledge how far we have come since founding the business 20 years ago. We are sincerely thankful to all our clients and staff for being on this journey with us now and into the future.”<\/p>\n<p>Brown outlined why this merger is significant for LehmanBrown’s clients: “Each market has its own complexities when it comes to business compliance, and navigating a new market needs local expertise and cross border knowledge and experience. As a result of this strategic integration, our clients can benefit from a wider spectrum of professional services and gain access to regional experts to help them navigate complex emerging Asian markets.” Brown continued: “I look forward to introducing our clients to the greater scope of services across the region that integration with Acclime now brings us.”<\/p>\n<p>LehmanBrown will continue to trade under its own brand and will remain in its existing offices for now. Over time there will be an integration of offices, service lines and branding. STS Capital Partners in Singapore acted as exclusive M&amp;A advisor to LehmanBrown in this transaction.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Acclime has completed a merger with LehmanBrown International Accountants in China as it continues to grow to be a leader in the PRC market.<\/p>\n","protected":false},"author":1,"featured_media":2787,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3703"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=3703"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3703\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/2787"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=3703"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=3703"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=3703"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}