{"id":3730,"date":"2021-10-21T14:56:44","date_gmt":"2021-10-21T07:56:44","guid":{"rendered":"https:\/\/www.acclime.com\/?p=3730"},"modified":"2022-10-05T15:10:23","modified_gmt":"2022-10-05T08:10:23","slug":"singapore-vs-hong-kong","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/insights\/singapore-vs-hong-kong\/","title":{"rendered":"Singapore vs Hong Kong: Which city is better as a base for doing business in Asia"},"content":{"rendered":"<p>The pandemic crisis has corporations re-evaluating the best location for their Asian headquarters. At the same time, Asian markets’ resilience to the crisis has provided a clear rationale for corporations across the globe to push forward plans to move closer to Asian markets, and the question as to where best to create a base is a key one. We have provided this comparison between two of the traditionally favoured locations: Hong Kong and Singapore.<\/p>\n<p>Spoiler alert: There is no clear answer, and there are other options beside these two. The answer to <strong>which is a better hub really depends on your strategy in Asia<\/strong> of course.<\/p>\n<p>As a premier corporate services provider right across Asia, Acclime naturally has a strong presence in <a href=\"https:\/\/hongkong.acclime.com\/\" target=\"_blank\" rel=\"noopener\">Hong Kong<\/a> where we have <a href=\"https:\/\/www.acclime.com\/press-release\/acclime-hong-kong-amalgamation\/\">amalgamated six corporate services companies<\/a> and have our roots. We also have a strong presence in <a href=\"https:\/\/singapore.acclime.com\/\" target=\"_blank\" rel=\"noopener\">Singapore<\/a> where we have amalgamated three corporate services companies. We are fully committed to our staff and clients in both territories, and as such, we strive to advise clients as to best options specific to their market and governance needs in their industry sector, in accordance with the client’s strategy.<\/p>\n<p>Acclime’s clients naturally raise questions when deciding where to locate their Asia headquarters, and we have learned to anticipate what those questions frequently might be. Here are some of the most common issues discussed in relation to establishing a base in Hong Kong or Singapore:<\/p>\n<h2 id=\"part1\">Ease of business<\/h2>\n<p>Both Hong Kong and Singapore have been favoured traditionally as the Asia base for corporations entering Asia due to comparative political stability, a reliable legal system, banking and financial regulations to meet global compliance demands and widespread use of English. Here is a look at how close they are in various business rankings:<\/p>\n<div class=\"uk-overflow-auto\">\n<table class=\"uk-table uk-table-striped uk-table-divider\">\n<tbody>\n<tr>\n<td><strong>Item<\/strong><\/td>\n<td><strong>Hong Kong ranking<\/strong><\/td>\n<td><strong>Singapore ranking<\/strong><\/td>\n<td><strong>Source<\/strong><\/td>\n<\/tr>\n<tr>\n<td>Ease of doing business (1 = easiest)<\/td>\n<td>3<\/td>\n<td>2<\/td>\n<td>World Bank <a href=\"https:\/\/data.worldbank.org\/indicator\/IC.BUS.EASE.XQ?locations=HK-SG\" target=\"_blank\" rel=\"noopener\">index 2019<\/a><\/td>\n<\/tr>\n<tr>\n<td>Enabling trade index<\/td>\n<td>3<sup>rd<\/sup> (136)<\/td>\n<td>1<sup>st<\/sup> (136)<\/td>\n<td>World Economic Forum <a href=\"https:\/\/reports.weforum.org\/global-enabling-trade-report-2016\/economy-profiles\/\" target=\"_blank\" rel=\"noopener\">index 2016<\/a><\/td>\n<\/tr>\n<tr>\n<td>Economic freedom<\/td>\n<td>2*<\/td>\n<td>1<\/td>\n<td>Heritage <a href=\"https:\/\/www.heritage.org\/index\/ranking\" target=\"_blank\" rel=\"noopener\">Index of Economic Freedom 2021<\/a><\/td>\n<\/tr>\n<tr>\n<td colspan=\"4\"><span class=\"uk-text-small\">*This was the ranking in 2020. In 2021, Heritage included HK in the greater China ranking of 107 (see this <a href=\"https:\/\/asia.nikkei.com\/Economy\/Heritage-Foundation-drops-Hong-Kong-from-economic-freedom-index\" target=\"_blank\" rel=\"noopener\">Nikkei news article<\/a>)<\/span><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<h2 id=\"part2\">Taxation<\/h2>\n<p>Both locations are attractive in terms of offering comparatively low corporate income tax (CIT) rates, which are well below the world average of 24%. However, Hong Kong does have some significant advantages over Singapore when considering a holding company location.<\/p>\n<ul>\n<li>Both territories have a low corporate tax rate: <a href=\"https:\/\/hongkong.acclime.com\/guides\/profits-tax\/\" target=\"_blank\" rel=\"noopener\">Hong Kong&#8217;s<\/a> 16.5% and <a href=\"https:\/\/singapore.acclime.com\/guides\/corporate-income-tax\/\" target=\"_blank\" rel=\"noopener\">Singapore’s<\/a> 17%<\/li>\n<li>Hong Kong does not tax dividends or interest income (potentially). Singapore does tax foreign dividends received in certain cases, but these are subject to double taxation relief;<\/li>\n<li>Singapore imposes a tax on other offshore income when remitted into Singapore, whereas there is no tax on any other offshore income in Hong Kong. However, Singapore does allow offset under its numerous <a href=\"https:\/\/singapore.acclime.com\/guides\/double-tax-agreements\/\" target=\"_blank\" rel=\"noopener\">double-taxation agreements<\/a><\/li>\n<li>There is no capital gains tax in either country, but do understand possible exceptions to this in Singapore: Read our <a href=\"https:\/\/singapore.acclime.com\/guides\/capital-gains-tax\/\" target=\"_blank\" rel=\"noopener\">Singapore guide to capital gains tax<\/a><\/li>\n<li><a href=\"https:\/\/singapore.acclime.com\/guides\/withholding-tax\/\" target=\"_blank\" rel=\"noopener\">Singapore imposes withholding tax<\/a> on royalties and interest, whereas <a href=\"https:\/\/hongkong.acclime.com\/guides\/withholding-tax\/\" target=\"_blank\" rel=\"noopener\">Hong Kong only applies withholding tax<\/a> on certain royalties<\/li>\n<li>There is no VAT\/GST in Hong Kong, whereas Singapore imposes a <a href=\"https:\/\/singapore.acclime.com\/guides\/goods-services-tax\/\" target=\"_blank\" rel=\"noopener\">7% GST<\/a><\/li>\n<li>Personal income tax is relatively low in both <a href=\"https:\/\/hongkong.acclime.com\/guides\/personal-income-tax\/\" target=\"_blank\" rel=\"noopener\">Hong Kong<\/a> and <a href=\"https:\/\/singapore.acclime.com\/guides\/personal-income-tax\/\" target=\"_blank\" rel=\"noopener\">Singapore<\/a><\/li>\n<li>Singapore has a comparatively more complex taxation system, as there are several incentives and exemptions, while Hong Kong generally has a simple and straightforward tax system<\/li>\n<\/ul>\n<p>See all our accounting &amp; tax guides for <a href=\"https:\/\/singapore.acclime.com\/guide-type\/accounting-tax\/\" target=\"_blank\" rel=\"noopener\">Singapore<\/a> and <a href=\"https:\/\/hongkong.acclime.com\/guide-type\/accounting-tax\/\" target=\"_blank\" rel=\"noopener\">Hong Kong<\/a>.<\/p>\n<h2 id=\"part3\">Compliance<\/h2>\n<p>Requirements for resident director\/company secretary<\/p>\n<p>A significant difference in company set up between the two territories, is that Singapore has a requirement that at least one director of the company be resident in Singapore, whereas Hong Kong allows all directors to be non-resident. The director must be a natural person with official residence in Singapore. This is an additional business expense, and foreign companies reluctant or unable to relocate a director of their own to Singapore often turn to corporate services providers like Acclime for advice and assistance.<\/p>\n<p>Both countries mandate the appointment of a company secretary, and both territories have a residence requirement. However, Hong Kong permits a Hong Kong registered and domiciled company to act as company secretary, while Singapore requires that the company secretary be a natural person. Again, the role of company secretary is often outsourced to licensed service providers such as Acclime.<\/p>\n<p>View our resident officer services in <a href=\"https:\/\/singapore.acclime.com\/business\/company-secretary\/\" target=\"_blank\" rel=\"noopener\">Singapore<\/a> and <a href=\"https:\/\/hongkong.acclime.com\/business\/company-secretary\/\" target=\"_blank\" rel=\"noopener\">Hong Kong<\/a>.<\/p>\n<p>Annual financial reporting<\/p>\n<p>Singapore and Hong Kong have similar financial reporting requirements, with the exception that Hong Kong has an annual audit requirement as standard for all companies. This annual audit has to be completed by a Hong Kong CPA.<\/p>\n<p>View our <a href=\"https:\/\/singapore.acclime.com\/guide-type\/accounting-tax\/\" target=\"_blank\" rel=\"noopener\">Singapore<\/a> and <a href=\"https:\/\/hongkong.acclime.com\/guide-type\/accounting-tax\/\" target=\"_blank\" rel=\"noopener\">Hong Kong<\/a> accounting &amp; tax guides.<\/p>\n<h2 id=\"part4\">Location<\/h2>\n<p>The proximity of Singapore to SEA and India, and Hong Kong’s integration with mainland China, are top factors for businesses when making a decision over which base to choose. This is not simply an ease of travel factor, but one that is related to access to the commercial and cultural ties.<\/p>\n<p>With a pivotal role in the commercialisation of the Greater Bay Area (GBA), Hong Kong will keep its position as the preferred sourcing and purchasing hub in the region. It also remains as Asia’s largest financial centre for the foreseeable future despite the current challenges. That said, the government of the PRC is promoting growth in Shenzhen, by relaxing controls on foreign currency exchange for example, that could rival Hong Kong as a base within the GBA.<\/p>\n<p>Singapore has overtaken Hong Kong as the largest container port in the region and has become the logistics centre for Asia. Hong Kong may be the best base for accessing the China mainland for now, but Singapore has perhaps become a better option for accessing Asia as a whole. Singapore is a member of ASEAN, the world’s third most populous market with 650 million inhabitants and 140 million new consumers.<\/p>\n<h2 id=\"part5\">Banking<\/h2>\n<p>Both Hong Kong and Singapore have first class banking facilities. As financial centres attracting a global customer base, both territories are familiar with the need for large international banking transactions and facilitate this well.<\/p>\n<p>The cost of banking services used to be slightly cheaper in Hong Kong, but these days there is less difference between them with Hong Kong fees rising.<\/p>\n<p>Hong Kong banks have a reputation for awkward procedures for non-residents to open the account. The account will be opened, but it’s not particularly easy. In both territories, the banks require an in-person interview with directors and authorised signatories, although some banks in Singapore have started allowing video conferencing for this. You can expect the process to take two to three weeks if you are non-resident, assuming you have all the necessary documentation. Acclime assists clients in preparing the bank account opening document bundle.<\/p>\n<p>Visit our guides for more information on opening bank accounts in <a href=\"https:\/\/hongkong.acclime.com\/guides\/opening-corporate-bank-account\/\" target=\"_blank\" rel=\"noopener\">Hong Kong<\/a> and <a href=\"https:\/\/singapore.acclime.com\/guides\/opening-corporate-bank-account\/\" target=\"_blank\" rel=\"noopener\">Singapore<\/a>.<\/p>\n<h2 id=\"part6\">Costs<\/h2>\n<p>There is not a significant difference in salary costs between the two territories. Singapore tends towards higher salaries at the top end, but that is reversed for middle management. Clerical staff are paid comparable wages.<\/p>\n<p>When it comes to office space rental, Hong Kong ranks as the most expensive location in the whole of the APAC region, beating Tokyo and Beijing. Singapore, however, is not far behind. Businesses in Singapore often opt for a business park to reduce rental costs, while Hong Kong companies can consider an outlying area, east of Kowloon for example.<\/p>\n<p>The pandemic has applied pressure on office rents in both locations, but the costs are falling faster in Hong Kong, where rents dropped 12% in the first half of 2020.<\/p>\n<h2 id=\"part7\">Talent<\/h2>\n<p>The talent pool in both territories is competitive on a global scale based on the ability to foster, attract and retain talent. Stories of differences in work culture are anecdotal, but these do tend to point to Hong Kong having a culture more favourable to business owners.<\/p>\n<p>English is an official language in both locations, but it is more widely spoken in Singapore where it is often considered a first language. Mandarin is spoken by approximately 50% of the population in both territories, and resourcing talent is not difficult. If your business requires regular contact with markets in the Greater Bay Area, then the fact that 97% of Hong Kong’s population speaks Cantonese as a first language could be a factor.<\/p>\n<p>The type of industry and the roles required will of course be a factor in deciding which location offers the deepest talent pool. For example, the Hong Kong’s trading history provides a rich source of sourcing\/purchasing talent, whereas Singapore’s strategy of being a regional hub for tech companies has ensured a healthy supply of digital talent. Acclime is happy to advise on acquiring the talent you will need for your business expansion.<\/p>\n<h2 id=\"part8\">Immigration<\/h2>\n<p>Working permits and visas are straight forward in both territories providing the corporate structure exists to support them. If you or your team are expats thinking of making a long-term move, both offer relief from the annual visa requirements by offering more permanent solutions. Hong Kong offers permanent residency status after seven years of living and working in the territory. Singapore goes a step further and will consider citizenship with a passport. This is attractive obviously, but you will need to consider what it might mean to other members of your family.<\/p>\n<h2 id=\"part9\">Conclusion<\/h2>\n<p>We have made comparisons between Singapore and Hong Kong to answer some of the common questions that our clients ask. As we have pointed out, both locations are attractive as an Asian base\/hub, and the answer to which is better really depends on your industry and your strategy.<\/p>\n<p>There is a picture emerging which sees the very large players separating the region into Greater China and Asia ex-China. Those businesses that need a large operation in mainland China create a Greater China HQ there. To back this up, a holding company is created in Hong Kong for the Greater China HQ. The rest of Asia is covered from a HQ in Singapore. It could be that you can consider both locations rather than choosing the ‘best’.<\/p>\n<div class=\"uk-alert uk-alert-default uk-padding uk-margin-medium-top\">\n<h3>Join our discussion on LinkedIn<\/h3>\n<p>\nDo you have an opinion? Cast your vote in our <a href=\"https:\/\/www.linkedin.com\/feed\/update\/urn:li:activity:6858236474123542528\" target=\"_blank\" rel=\"noopener\">LinkedIn poll<\/a>.<\/p>\n<p>If you have comments and would like to join the discussion on this topic, we invite you to do so on our <a href=\"https:\/\/www.linkedin.com\/feed\/update\/urn:li:activity:6858236474123542528\" target=\"_blank\" rel=\"noopener\">LinkedIn post<\/a>. Let us know your thoughts and concerns about locating an Asian base in Hong Kong or Singapore.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>The question &#8216;where to create an Asia base&#8217; is a key one. We provide this comparison between two favoured locations: Hong Kong and Singapore.<\/p>\n","protected":false},"author":1,"featured_media":3735,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[182],"tags":[431],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3730"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=3730"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3730\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/3735"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=3730"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=3730"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=3730"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}