{"id":3934,"date":"2021-11-15T08:00:40","date_gmt":"2021-11-15T00:00:40","guid":{"rendered":"https:\/\/www.acclime.com\/?p=3934"},"modified":"2021-11-12T16:10:34","modified_gmt":"2021-11-12T08:10:34","slug":"eduard-pieters-cio","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/eduard-pieters-cio\/","title":{"rendered":"Acclime announce Eduard&nbsp;Pieters as the Acclime&nbsp;Group&nbsp;CIO"},"content":{"rendered":"<p>15 November 2021, Hong Kong &ndash; Acclime, the premier corporate services provider in Asia, is pleased to announce today that it has appointed Eduard Pieters as the company&rsquo;s Chief Information Officer (CIO), effective immediately.<\/p>\n<p>Eduard Pieters has deep experience managing IT organisations in and around Asia, both in the corporate services sector as well as in other industries. His most recent role was as CIO of Meratus Group, a major Indonesian shipping and logistics company, where he transformed that company&rsquo;s adoption of technology over a six-year period. Prior to that, Pieters rose through the ranks at TMF over a 16-year span, culminating in his role as Regional IT Director for the APAC region. Pieters lives in Jakarta and will work out of Acclime&rsquo;s Indonesia office.<\/p>\n<p>As CIO, Pieters will drive Acclime&rsquo;s technology strategy to be better &lsquo;tech-enabled&rsquo; for the benefit of clients and team. In Acclime&rsquo;s role as a premier corporate services provider, it is essential to provide and maintain our IT governance with a Risk &amp; Compliance (GRC) framework that ensures data security and information management. Pieters will prioritise delivering best practices in data protection, IT security and operational processes through ISO27001 accreditation. He will also ensure that companies joining Acclime through acquisition are able to fully integrate their technology.<\/p>\n<p>&ldquo;Acclime needs a strong and experienced CIO to not only develop and secure our IT applications, but also lead the drive for our clients and teams to fully embrace the benefits of our technological tools.&rdquo; Martin Crawford, Co-founder and CEO of Acclime said. &ldquo;Eduard Pieters is the outstanding individual we see as delivering our goal of becoming &lsquo;tech-enabled&rsquo; across our group.&rdquo;<\/p>\n<p>&ldquo;My strategy involves developing in-house applications to integrate with our third-party technology &lsquo;stack&rsquo; to digitise our daily tasks, make life less complicated for our clients and generally create workflows that are more productive, paperless, and more enjoyable for our employees.&rdquo; Eduard Pieters, CIO of Acclime declared. &ldquo;I look forward to taking on this responsibility with such a forward-thinking organisation as Acclime.&rdquo;<\/p>\n<p>Eduard Pieters appointment is already effective and he can be contacted <a href=\"\/contact\/\">here<\/a>. You can read more about his background on <a href=\"\/people\/\">our People<\/a> page.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Acclime is pleased to announce it has appointed Eduard Pieters as the company&rsquo;s Chief Information Officer (CIO), effective immediately.<\/p>\n","protected":false},"author":1,"featured_media":3909,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3934"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=3934"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3934\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/3909"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=3934"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=3934"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=3934"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}