{"id":3963,"date":"2021-12-20T08:49:40","date_gmt":"2021-12-20T00:49:40","guid":{"rendered":"https:\/\/www.acclime.com\/?p=3963"},"modified":"2021-12-20T08:51:06","modified_gmt":"2021-12-20T00:51:06","slug":"docspark-solutions-acquisition","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/docspark-solutions-acquisition\/","title":{"rendered":"Acclime consolidates Philippines presence with DocSpark Solutions acquisition"},"content":{"rendered":"<p>Acclime, the premier corporate services provider in Asia, announces today that it has completed the acquisition of DocSpark Solutions in the Philippines. This move represents the latest step in Acclime’s active growth as the Asia specialist in providing compliance and corporate services throughout the region. Acclime’s service provision now covers 10 territories across Asia-Pacific, with client support centres in the US, UK and Netherlands. Acclime boasts local corporate services expertise in 20 offices in Asia, with a total headcount of over 700.<\/p>\n<p>DocSpark Solutions is a Manila-based firm specialising in helping businesses to scale their operations, expand internationally, meet their compliance obligations, project manage complex work streams, and outsource elements of their resourcing requirements through Employer of Record (EOR) services. DocSpark is managed and run by Johann Espiritu and Marla Luisa Aquino-Batallones, both highly skilled lawyers possessing considerable, international experience with top law firms. Both Johann and Marla are joining the Acclime management team.<\/p>\n<p>“Acclime has a mission to enhance the standards of corporate governance across Asia, especially in emerging markets” remarked Martin Crawford, Co-founder and CEO of Acclime. “We are confident that merging with DocSpark Solutions will give Acclime clients looking to expand to the Philippines the highest standard of corporate services available. This is a timely move for Acclime, and we are delighted to welcome Johann and Marla to the team.”<\/p>\n<p>DocSpark’s clients within the Philippines will see a continuation of the services they have enjoyed, with no changes to their point of contact or the terms of the agreements in place. However, they now additionally have a seamless reach to a full suite of corporate services across the region. “This is a fantastic opportunity for our clients as they now have access to Acclime&#8217;s broad pool of talent and resources across 10 markets” said Johann Espiritu, CEO of DocSpark Solutions. “Acclime is a specialist in a wide range of corporate services throughout Asia, particularly in EOR, payroll, accounting, licensing and legal support. We are delighted to be able to extend these services to our Philippines clients in multiple territories.”<\/p>\n<p>“We are very excited about the opportunity to welcome the Acclime clients from the region to work with us in the Philippines. This merger allows us to scale up our operation and expand the senior accounting\/finance personnel in our team, thus firmly planting the Acclime flag here” added Marla Luisa Aquino-Batallones, COO of DocSpark Solutions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Acclime, the premier corporate services provider in Asia, announces today that it has completed the acquisition of DocSpark Solutions in the Philippines. This move represents the latest step in Acclime’s active growth as the Asia specialist in providing compliance and corporate services throughout the region. Acclime’s service provision now covers 10 territories across Asia-Pacific, with [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3965,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3963"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=3963"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3963\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/3965"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=3963"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=3963"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=3963"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}