{"id":3986,"date":"2022-01-06T07:00:56","date_gmt":"2022-01-05T23:00:56","guid":{"rendered":"https:\/\/www.acclime.com\/?p=3986"},"modified":"2022-01-05T12:01:39","modified_gmt":"2022-01-05T04:01:39","slug":"acclime-doubles-its-presence-in-malaysia-with-the-acquisition-of-hmc-corporate-services","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-doubles-its-presence-in-malaysia-with-the-acquisition-of-hmc-corporate-services\/","title":{"rendered":"Acclime doubles its presence in Malaysia with the acquisition of HMC Corporate Services"},"content":{"rendered":"<p>Acclime, the premier corporate services provider in Asia, announces that it has completed the acquisition of HMC Corporate Services (HMC) in Malaysia. With this new addition, the headcount of Acclime in Malaysia surpasses 80, doubling the size of Acclime&rsquo;s business in the important Malaysian market.<\/p>\n<p>Acclime&rsquo;s expansion in Malaysia continues its active growth as the Asia specialist in providing compliance and corporate services throughout the region. Acclime&rsquo;s service provision now covers 10 territories across Asia-Pacific, with client support centres in the US, UK and Netherlands. Acclime boasts local corporate services expertise in 20 offices in Asia, with a total headcount of over 700.<\/p>\n<p>HMC is a well-established corporate services firm specialising in corporate secretarial and advisory consultancy at a board level, and servicing a diversified client base ranging from public listed companies and MNCs to local SMEs and start-ups. HMC employs over 40 talented professionals working closely with IPO sponsors and larger audit firms in Malaysia on the full range of corporate services in its Headquarters in Kuala Lumpur and branches in Batu Pahat and Seremban.<\/p>\n<p>Ms Wong Youn Kim, the Director of HMC will join Acclime as a Director while continuing to be responsible for HMC&rsquo;s client portfolio. The business will merge with Acclime&rsquo;s existing Malaysia business early in 2022, with Ms Wong working closely with Henry Ng, Managing Director of Acclime Malaysia.<\/p>\n<p>&ldquo;Malaysia is one of the world&rsquo;s most competitive markets, with China being its largest trading partner. Acclime has supported FDI clients expanding to Malaysia by providing outsourced licensing, governance and accounting solutions. With the acquisition of HMC, we can greatly strengthen our services and support for large International clients and clients listed on Bursa Malaysia.&rdquo; Martin Crawford, co-founder and CEO of Acclime remarked.<\/p>\n<p>Henry Ng commented &ldquo;Combining the Acclime and HMC teams gives us a total headcount of 80 full-time employees servicing more than 3,000 clients, bringing Acclime into the top tier of corporate service providers in Malaysia. We look forward to working together to combine our knowledge and resources to better serve a wider range of clients with a greater range of professional services.&rdquo;<\/p>\n<p>&ldquo;This is an exciting new chapter for all of us and we are thrilled to be part of a regional group, able to provide high-quality services in 10 markets,&rdquo; Ms Wong commented. &ldquo;I am excited that we can now support our clients who wish to expand their businesses to other Asian markets.&rdquo;<\/p>\n<p>Donovan &amp; Ho acted as legal counsel to Acclime in this acquisition and Premier Consult Solutions and Oxbridge Advisory advised the parties in the transaction.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Acclime is now partnered with HMC Corporate Solution in a strategic move that elevates our business and services to a higher level in Malaysia.<\/p>\n","protected":false},"author":1,"featured_media":3987,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3986"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=3986"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/3986\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/3987"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=3986"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=3986"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=3986"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}