{"id":4419,"date":"2022-02-21T08:37:17","date_gmt":"2022-02-21T00:37:17","guid":{"rendered":"https:\/\/www.acclime.com\/?p=4419"},"modified":"2022-02-21T10:32:24","modified_gmt":"2022-02-21T02:32:24","slug":"lehmanbrown-international-rebrands","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/lehmanbrown-international-rebrands\/","title":{"rendered":"Acclime consolidates its growing presence in China with the rebranding of LehmanBrown International"},"content":{"rendered":"<p>Acclime, the premier corporate services provider in Asia, is pleased to announce today that LehmanBrown International Accountants in China has completed its integration with the Acclime group of companies. Following the acquisition by Acclime late last year, LehmanBrown International Accountants has now fully rebranded as part of Acclime China. This move brings Acclime’s headcount in China to over 200, and over 700 across the whole group.<\/p>\n<p>Founded more than 20 years ago by Russell Brown OBE, LehmanBrown International Accountants has an enviable reputation for assisting foreign organisations from a wide range of industries and sectors enter the China market. The company offers a full suite of incorporation and ongoing corporate compliance, accounting, and tax services which support, consolidate and expand the corporate services already offered by Acclime China.<\/p>\n<p>Acclime Group is pleased to announce that both Russell Brown  and Zhou Han Brown have become full Partners in the Acclime group. Russell Brown will additionally take on the role of Vice Chairman of the Acclime Group, and will join the Board Audit Committee.<\/p>\n<p>“At Acclime, we aspire to become Asia’s premier corporate services firm, elevating the standards of corporate governance everywhere we operate. The addition of the LehmanBrown team to Acclime China adds significantly to the breadth and depth of expertise in corporate services across China, while maintaining our commitment to personalised client care,” said Martin Crawford, CEO and Founder of Acclime Group. “We look forward to introducing LehmanBrown’s corporate clients to our regional expertise in Greater China, Australia, Singapore, Vietnam, Indonesia, Thailand, Cambodia, Malaysia and the Philippines,” he added.<\/p>\n<p>“We are excited and delighted to become an integral part of a large international team with established resources across Acclime’s network,” Russell Brown said. “We are confident we can provide even greater value to our existing clients, through a broader array of services supported with a technology platform that will enhance the way we deliver service.”<\/p>\n<p>LehmanBrown will now trade under the Acclime brand and the LehmanBrown teams have co-located with the Acclime teams in Beijing, Shenzhen and Hong Kong. Currently Acclime China has offices in Shanghai, Beijing, Shenzhen, Guangzhou and Hong Kong.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Acclime is pleased to announce that LehmanBrown International in China has completed its integration with the Acclime group of companies.<\/p>\n","protected":false},"author":1,"featured_media":4448,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4419"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=4419"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4419\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/4448"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=4419"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=4419"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=4419"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}