{"id":4475,"date":"2022-03-08T08:00:05","date_gmt":"2022-03-08T00:00:05","guid":{"rendered":"https:\/\/www.acclime.com\/?p=4475"},"modified":"2022-03-07T12:01:48","modified_gmt":"2022-03-07T04:01:48","slug":"acclime-completes-the-doubling-of-its-presence-in-malaysia-with-the-integration-of-hmc-corporate-services","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-completes-the-doubling-of-its-presence-in-malaysia-with-the-integration-of-hmc-corporate-services\/","title":{"rendered":"Acclime completes the doubling of its presence in Malaysia with the integration of HMC Corporate Services"},"content":{"rendered":"<p>Acclime, the premier corporate services provider in Asia, is delighted to announce today that HMC Corporate Services in Malaysia has completed its integration with the Acclime group of companies. HMC Corporate Services is now fully rebranded as Acclime. This move brings the headcount of Acclime in Malaysia to 80, doubling the size of Acclime&rsquo;s business in the important Malaysian market.<\/p>\n<p>HMC Corporate Services has a long history of specialising in corporate secretarial and advisory consultancy at a board level, and servicing a diversified client base ranging from public listed companies and MNCs to local SMEs and start-ups. Ms Wong Youn Kim, the Director of HMC has joined Acclime as a Director, working closely with Henry Ng, Managing Director of Acclime Malaysia, and henceforth, HMC will trade under the Acclime brand. HMC&rsquo;s 40 talented professionals will continue working closely with IPO sponsors and larger audit firms in Malaysia on the full range of corporate services offered by the Acclime group.<\/p>\n<p>&ldquo;Malaysia is one of the world&rsquo;s most competitive markets, with China being its largest trading partner. Acclime has supported FDI clients expanding to Malaysia by providing outsourced licensing, governance and accounting solutions. With the acquisition of HMC, we can greatly strengthen our services and support for large international clients and clients listed on Bursa Malaysia.&rdquo; Martin Crawford, co-founder and CEO of Acclime remarked.<\/p>\n<p>Henry Ng commented &ldquo;Combining the Acclime and HMC teams gives us a total headcount of 80 full-time employees servicing more than 3,000 clients, bringing Acclime into the top tier of corporate service providers in Malaysia. We look forward to working together to combine our knowledge and resources to better serve a wider range of clients with a greater range of professional services.&rdquo;<\/p>\n<p>Acclime&rsquo;s expansion in Malaysia continues its active growth as the Asia specialist in providing compliance and corporate services throughout the region. Acclime&rsquo;s service provision now<\/p>\n<p>covers 10 territories across Asia-Pacific, with client support centres in the US, UK and Netherlands. Acclime boasts local corporate services expertise in 20 offices in Asia, with a total headcount of over 700.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>HMC Corporate Services in Malaysia has completed its integration with the Acclime group of companies and HMC is now rebranded as Acclime.<\/p>\n","protected":false},"author":1,"featured_media":4478,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4475"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=4475"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4475\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/4478"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=4475"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=4475"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=4475"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}