{"id":4480,"date":"2022-03-07T14:07:16","date_gmt":"2022-03-07T06:07:16","guid":{"rendered":"https:\/\/www.acclime.com\/?p=4480"},"modified":"2022-06-21T17:34:22","modified_gmt":"2022-06-21T09:34:22","slug":"international-womens-day-debby","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/news\/international-womens-day-debby\/","title":{"rendered":"Celebrating International Women’s Day with Acclime Co-Founder, Debby Davidson"},"content":{"rendered":"<p>Throughout the month of March, Acclime celebrates women around the world and wishes them a wonderful International Women&#8217;s Day, filled with many special moments with family, friends and colleagues.<\/p>\n<p>We are proud to highlight the profiles of some of our amazing women leaders across our Acclime offices in Asia and Europe, by sharing their personal stories of success, resilience and leadership.<\/p>\n<p>Today, we are excited to share a first leadership interview with <strong>Debby Davidson – COO\/Co-founder of Acclime<\/strong> – about her experience and growth journey that got her to where she is now.<\/p>\n<h2>About Debby Davidson<\/h2>\n<p>Debby is the co-founder and COO of Acclime. She is a lawyer, an entrepreneur, a mother of two and a wannabe gardener. She also has 20 years’ professional services experience such as corporate, debt finance, capital markets and private equity transactions. More specifically, Debby regularly advises clients on corporate structures, exit strategies, succession planning, trust, cross-border taxation issues and other relevant commercial and private wealth matters.<br \/>\nIn December 2018, Debby co-founded Acclime, and acts the Acclime’s COO. Acclime is rapidly expanding its presence as the premier Asia-focused corporate services provider.<\/p>\n<h3><em>In your opinion, what does it mean to be a great leader today?<\/em><\/h3>\n<p><strong>Debby: <\/strong>Some leaders lead from the front, while other leaders inspire and support from the background, inspiring confidence from within to enable the team’s members to emerge, lead and innovate. The leader in the background supports the team’s initiatives.<\/p>\n<p>Great leaders are those who are genuinely passionate about the corporate vision. They are humble, accountable, have great empathy and are forever resilient.<\/p>\n<p>I remain grateful that I am able to play a meaningful leadership role at Acclime and to work alongside such inspirational, dedicated, ambitious people. I try my best to live up to the trust that our employees, clients and staff continue to place in me.<\/p>\n<h3><em>Can you share a few words about your personal and professional story that led you to Co-founding Acclime, and why have you chosen this path in your development?<\/em><\/h3>\n<p><strong>Debby: <\/strong>Martin and I have been friends for many years, and over many coffees we stated and debated our vision of the ideal Asian professional services firm. The opportunity did not arise for many years, but in 2018 the stars aligned, and we were fortunate to be able to launch Acclime within three countries. We were humbled that we were joined by such an amazing group of investors and founding partners who shared our vision, and who devoted themselves to the united cause of building Asia’s premier corporate services firm.<\/p>\n<p>As to why I personally chose this industry; I arrived almost by accident. The demands of raising a young family caused me to leave my legal career and become an entrepreneur, building an inclusive workforce in a business I would be proud to also call ‘home’. I think my own journey shows that working mums need to be resilient and flexible, as it is rare that life turns out exactly as we planned. In my case, leaving law has had the biggest silver lining.<\/p>\n<h3><em>Can you share about one of your biggest challenges you had to overcome in your professional journey?<\/em><\/h3>\n<p><strong>Debby: <\/strong>I tend to be overly self-critical. If something doesn’t go according to plan, I tend to over analyse and blame myself for failing to spot every eventuality. It may be a surprise to the Acclime family, but I am actually an introvert and find group attention awkward and embarrassing. I really hate being the center of attention.<\/p>\n<p>These days, I worry less about criticism, mostly because I have no time to fret. I think I overcame these obstacles through failures. Like everyone else, I have had my own record of failures, which have led me to become humbler and more resilient: if the worst has already happened, how much worse can it be?<\/p>\n<h3><em>What important lessons have you learned throughout your professional development which you believe to be relevant for women professionals aspiring to be the next leaders of tomorrow?<\/em><\/h3>\n<p><strong>Debby: <\/strong>My idea of success at age 20 was very different from my idea now. I had set my eyes on working in New York or London, and only working for the top two or three law firms in the world. I saw everything else as a failure. My worldview was very limited, and very black and white.<\/p>\n<p>My own career has proven life is full of opportunities. <strong>There are limitless routes to success, but only if you are willing to have an open and positive mindset. Don’t be the person holding yourself back.<\/strong><\/p>\n<p>Secondly, life never goes according to plan. If Plan A doesn’t work out, go for Plan B, C or D. But never stop trying.<\/p>\n<h3><em>Tell us one thing about Acclime’s culture that you absolutely love?<\/em><\/h3>\n<p><strong>Debby: <\/strong>We share a passion and a united goal, which is to build Asia’s premier corporate services business. Acclime people are just passionate; about servicing our clients, about pushing forward in our industry and market share, about new service lines and about building the brand. We are consumed by the momentum of Acclime and we all want to play our part in building the business, like musicians coming together to create an orchestra.<\/p>\n<p>I just love the buzz and the energy in Acclime, and our belief that together, we are strong.<\/p>\n<p>&nbsp;<\/p>\n<p>Acclime would like to express a deep thank you to Debby Davidson for sharing with us her inspiring leadership and growth journey story. We hope that her ideas will be an inspiration for all future leaders and will empower them to reach their potential and achieve their dreams.<\/p>\n<p>Once again, Acclime praises our muses and acknowledges how amazing and wonderful they are. Respect and cherish them every single day. Happy Women’s Day!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We share a leadership interview with Debby Davidson, COO\/Co-founder of Acclime, about her experience and growth journey.<\/p>\n","protected":false},"author":1,"featured_media":780,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[276],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4480"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=4480"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4480\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/780"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=4480"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=4480"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=4480"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}