{"id":4496,"date":"2022-03-22T08:00:50","date_gmt":"2022-03-22T00:00:50","guid":{"rendered":"https:\/\/www.acclime.com\/?p=4496"},"modified":"2022-03-22T18:15:55","modified_gmt":"2022-03-22T10:15:55","slug":"docspark-rebrands","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/docspark-rebrands\/","title":{"rendered":"DocSpark Solutions rebrands as Acclime Philippines"},"content":{"rendered":"<p>Acclime, the premier corporate services provider in Asia, is delighted to announce today that DocSpark Solutions has completed its integration into the Acclime group of companies. Following the acquisition by Acclime late last year, DocSpark Solutions has now fully rebranded as Acclime Philippines. In addition to its presence in 10 key locations across Asia-Pacific, with client support centres in the US, UK and Netherlands, Acclime&rsquo;s footprint now extends into the Philippines.<\/p>\n<p>Led by Johann Espiritu and Marla Luisa Aquino-Batallones, DocSpark Solutions has an enviable reputation in assisting foreign organisations enter the Philippines market. The company offers a full suite of services in company formation, corporate compliance services, licensing, HR services and employment services, and will be extending their services to Philippines&rsquo;s clients in other locations.<\/p>\n<p>Acclime Group is pleased to announce that Johann Espiritu has become a full partner of Acclime and Marla Luisa Aquino-Batallones will take on the role as the Operations Director.<\/p>\n<p>&ldquo;Acclime aspires to become Asia&rsquo;s premier corporate services firm and this merger allows Acclime to expand its business in Asia and continue to grow its pipeline of compliance and corporate services,&rdquo; said Martin Crawford, Co-founder and CEO of Acclime. &ldquo;DocSpark Solutions addition to the group will give Acclime clients looking to expand to the Philippines the highest standard of corporate services available. We are delighted to welcome Johann and Marla to the team.&rdquo;<\/p>\n<p>&ldquo;DocSpark Solutions chose to partner with Acclime because of our cultural similarities and professional styles. As a part of Acclime, we are positive that we can provide greater value to our existing clients and offer services to clients across the Asia-pacific region.&rdquo; said Johann Espiritu, CEO of DocSpark Solutions.<\/p>\n<p>&ldquo;Merging with Acclime allows us to scale up our operations and support our clients who wish to expand to other Asian territories,&rdquo; stated Marla Luisa Aquino-Batallones, COO of DocSpark Solutions. &ldquo;We are both very excited about being a partner of the Acclime group; everyone has been so helpful and easily made us a part of the team&rdquo;.<\/p>\n<p>With the acquisition of DocSpark Solution, Acclime&rsquo;s service provision now covers 11 territories across Asia-Pacific, boasts local corporate services in 20 offices and has a headcount of over 700. DocSpark Solutions will trade under the Acclime brand and remain in its existing office for now.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Acclime, the premier corporate services provider in Asia, is delighted to announce today that DocSpark Solutions has completed its integration into the Acclime group of companies. Following the acquisition by Acclime late last year, DocSpark Solutions has now fully rebranded as Acclime Philippines. In addition to its presence in 10 key locations across Asia-Pacific, with [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2807,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4496"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=4496"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4496\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/2807"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=4496"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=4496"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=4496"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}