{"id":4528,"date":"2022-03-23T10:00:32","date_gmt":"2022-03-23T02:00:32","guid":{"rendered":"https:\/\/www.acclime.com\/?p=4528"},"modified":"2022-06-21T17:39:47","modified_gmt":"2022-06-21T09:39:47","slug":"womens-leadership","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/news\/womens-leadership\/","title":{"rendered":"In March, Acclime celebrates women’s leadership"},"content":{"rendered":"<p>In March, we invite our female leaders across the Acclime group to share their unique experiences and perspectives on what it means to be a leader, in hope of inspiring all of us to be open and proactive to new opportunities and challenges, to become a better version of ourselves, day by day.<\/p>\n<p><img decoding=\"async\" class=\"alignleft\" style=\"width: 80px; height: 80px; margin-right: 20px; margin-top: 20px; border-radius: 50%;\" src=\"\/wp-content\/uploads\/Debby-Davidson-teal.jpg\" \/><\/p>\n<h3>Debby Davidson <em>COO &amp; Cofounder – Acclime<\/em><\/h3>\n<p>My idea of success at age 20 was very different from my idea now. I had set my eyes on working in New York or London, and only working for the top two or three law firms in the world. I saw everything else as a failure. My worldview was very limited, and very black and white.<\/p>\n<p>My own career has proven life is full of opportunities. <strong>There are limitless routes to success, but only if you are willing to have an open and positive mindset. Don’t be the person holding yourself back.<\/strong><\/p>\n<p>Secondly, life never goes according to plan. If Plan A doesn’t work out, go for Plan B, C or D. But never stop trying.<\/p>\n<p><img decoding=\"async\" class=\"alignleft\" style=\"width: 80px; height: 80px; margin-right: 20px; margin-top: 20px; border-radius: 50%;\" src=\"\/wp-content\/uploads\/Nikki_Foster_Le-Grys-orange.jpg\" \/><\/p>\n<h3>Nikki Foster Le-Grys <em>Regional Director – Acclime UK &amp; Europe<\/em><\/h3>\n<p><strong>Be Yourself<\/strong> – I spent too much of my early career trying to be the person I thought everyone else at work wanted me to be. It was tiring. I’m the same person at home, at work, with my friends. Yes be professional, but be authentic.<\/p>\n<p><strong>The 3 D’s – Data, Delivery and Discernment. <\/strong><\/p>\n<ul>\n<li>Data – the most successful businesses harness data for competitive advantage. You might not always have access to big data in your company, or be the decision maker, but champion the power of data and access relevant statistics to your job or industry, and use it to your advantage.<\/li>\n<li>Delivery – make stuff happen. Deliver on what you are asked to do and what you’ve said you’ll do. So be realistic about what you can achieve and plan properly so you can always deliver without burning out in the process.<\/li>\n<li>Discernment – developing this can be hard but totally achievable. Take time to reflect and contemplate, listen to your intuition, and be open and aware. This will help you notice the details, make better decisions and connect with others.<\/li>\n<\/ul>\n<p><strong>Stop Comparing – at work, in life, ever!<\/strong> It’s obviously natural to compare yourself to others and it’s especially hard in this Instagram-able world we live in. But the less you worry about what others are doing and the more you focus on your values and goals, the happier you will be at work and in life.<\/p>\n<p><strong>Creative Visualisation<\/strong> – psychologically proven to change the way you think and help you manifest what you want. The more you practice the more you can achieve your goals. You can try doing it at the start of every week, before a big presentation, or even prior to a meeting which you expect to be challenging. Check out this article if you want to <a href=\"https:\/\/www.psychologytoday.com\/gb\/blog\/in-flux\/201606\/the-benefits-creative-visualization\" target=\"_blank\" rel=\"noopener\">learn more.<\/a><\/p>\n<p><strong>Be Kind<\/strong> – to yourself and other people. Things will go wrong, you (and everyone else in the world) will make mistakes, and sometimes you’ll disagree on how best to do things. And that’s ok. How you respond to those situations is what matters – listen, stay calm and admit when you’re wrong.<\/p>\n<p><img decoding=\"async\" class=\"alignleft\" style=\"width: 80px; height: 80px; margin-right: 20px; margin-top: 20px; border-radius: 50%;\" src=\"\/wp-content\/uploads\/betty-teal.jpg\" \/><\/p>\n<h3>Betty Gervasini <em>Partner – Acclime Vietnam<\/em><\/h3>\n<p>We all know that the corporate world has been dominated by men for centuries; however, it does not mean there is no place for women. In the 21<sup>st<\/sup> century, International Women’s Day is a global celebration that recognises women’s incredible achievements, raises awareness and encourages others to advocate for gender equality.<\/p>\n<p>There will always obstacles along the way for our voices to be heard and to lead, perseverance will lead us there. Always believe in oneself, trust our women instinct, and spread your passion to the people around you.<\/p>\n<p><strong>We, women are passionate people and we always make things happen, be it at home or at work. <\/strong><strong>Where there is a woman, there is magic.<\/strong><\/p>\n<p><img decoding=\"async\" class=\"alignleft\" style=\"width: 80px; height: 80px; margin-right: 20px; margin-top: 20px; border-radius: 50%;\" src=\"\/wp-content\/uploads\/Ramute-1.jpg\" \/><\/p>\n<h3>Ramute Marciukoniene<em> Senior Manager, Accounting &amp; Tax – Acclime Singapore<\/em><\/h3>\n<p>Based on my experience, I<strong> could identify that building a strong self-confidence is important in the professional work environment.<\/strong> This goes in line with establishing a supportive network. We are all facing similar challenges. If we can reach out to each other for support or to share ideas, this can help grow our self-confidence and push us to achieve even more. It is also important to share success stories among all of us.<\/p>\n<p><img decoding=\"async\" class=\"alignleft\" style=\"width: 80px; height: 80px; margin-right: 20px; margin-top: 20px; border-radius: 50%;\" src=\"https:\/\/cambodia.acclime.com\/wp-content\/uploads\/ly-chheng-teal.jpg\" \/><\/p>\n<h3>Chheng Ly <em>Manager, Tax &amp; Corporate – Acclime Cambodia<\/em><\/h3>\n<p>“Luck and opportunity happen to who is ready. Be a better you and be proactive to accept a new opportunity.” Saying “Yes” to new opportunities is my advice for you. For example, when your leader assigns you to a project, rather than wait for instructions from your supervisor or being afraid of your ability, take the first step to discuss the matters with them. This way, proactivity can lead to progress for the organisation and for you as a professional.<\/p>\n<p><img decoding=\"async\" class=\"alignleft\" style=\"width: 80px; height: 80px; margin-right: 20px; margin-top: 20px; border-radius: 50%;\" src=\"\/wp-content\/uploads\/zhou-han-orange.jpg\" \/><\/p>\n<h3>Zhou Han Brown <em>Partner – Acclime<\/em><\/h3>\n<p>I was brought up in Mainland China with very strict parents. It was a very different educational environment back then in comparison with now. China has always stressed the equality of men and women, in fact Chairman Mao said that women hold up half of the sky. And so I did not feel that we were any different from men when we left university to start work.<\/p>\n<p>I started my first job in 1992 working for a Chinese state-owned investment company under the Ministry of Commerce. I have since worked in different companies both Chinese and foreign in China and outside of China. Every time when I changed my job, I have learnt new things and gained new skills, but I have always approached every new challenge with an open mind and with a view to learning.<\/p>\n<p><strong>One very important lesson that I have learnt is that there will not be any development in one’s professional career without hard work, no lessons learnt without mistakes.<\/strong> In China, most people in our industry are women. Women have a natural instinct to be detailed and gentle, which works well with our accounting work and a modern-day approach – empathy at work place and working as teams. Over the years of my working life, I have got a habit of not giving up, even though as I go along each journey my plan might need tweaking to taking into account different circumstances. I would like to think that women are very resilient and with perseverance. I had experienced many failures at work place, failed job interviews, missing out on promotions because my work experience was not enough. After working aboard for a few years, I returned to China with my husband in 2001 where we founded LehmanBrown International Accountants. Though working in our own business, I started learning how to fail and to learn from it, and in business there are many hard decisions that have to be made, and not all of them always go to plan. Over the 20 years with LehmanBrown and now with Acclime, I continue to challenge myself in learning and personal development.<\/p>\n<p>Women also have ability of multi-tasking and take things with a pragmatic approach. Therefore, decisions are made with sensible thoughts and planning.<\/p>\n<p>To be a leader, I always believe that you have to lead by example. That means you need to fight in the tranches with your troops! “Lead by example” is what I think a true leader needs to have. At times, a leader has to get her\/his hands dirty to figure out with the team members. A leader should not be feared, but should aspire the team members. Aspiring is not enough, leaders need to give the support to their teams when they need it. That is a leader needs to have the guts to make tough decisions with a view that it may not always be the right one.<\/p>\n<p><strong>To the six amazing women, we thank you for honestly sharing your growth stories with us. And to the many other female role models amongst us whose stories we have not been able to feature in this press release, continue to inspire and do the great work in your community.<\/strong><\/p>\n<p>Once again, Acclime praises our muses and acknowledges how amazing and wonderful they are.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In March, we invite our female leaders across the Acclime group to share their unique experiences and perspectives on what it means to be a leader, in hope of inspiring all of us to be open and proactive to new opportunities and challenges, to become a better version of ourselves, day by day. Debby Davidson [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":4431,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[276],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4528"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=4528"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4528\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/4431"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=4528"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=4528"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=4528"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}