{"id":4603,"date":"2022-04-27T10:28:07","date_gmt":"2022-04-27T02:28:07","guid":{"rendered":"https:\/\/www.acclime.com\/?p=4603"},"modified":"2022-04-27T10:38:53","modified_gmt":"2022-04-27T02:38:53","slug":"acclime-partners-with-aventura","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-partners-with-aventura\/","title":{"rendered":"Aventura Group and Acclime enter into a strategic partnership"},"content":{"rendered":"<p>Aventura Group AB (Aventura), the China focused e-commerce enabler and brand development company, forms a strategic partnership with Acclime, Asia’s premier corporate services group, to offer joint solutions to e-commerce clients.<\/p>\n<p>Aventura Group offers turn-key solutions to international brands seeking to access China’s consumer markets, with a focus on brand management, e-commerce sales and operations.<\/p>\n<p>Increasingly, Aventura’s existing and prospective customers require assistance with company administration, reporting and compliance. To date, Aventura Group has offered limited corporate administrative support through its own accounting team.<\/p>\n<p>Post a strategic review, the Board of Aventura has concluded that the company should strengthen this part of its offering, either by building additional capability in-house, or through a partnership with an established player.<\/p>\n<p>Subsequently, Aventura has decided to enter into a strategic partnership with Acclime, an established corporate services provider in Asia. The group boosts a presence across 11 countries across Asia-Pacific and a headcount of 700, 200 of whom are located in offices in Beijing, Shanghai, Guangzhou, Shenzhen and Hong Kong. Acclime offers a full range of corporate support services, comprising company formation, HR outsourcing, reporting, compliance, tax and corporate secretarial services to a client base of more than 7,500 international and regional clients.<\/p>\n<p>Under the terms of the partnership, Acclime will take over the responsibility for the accounting and corporate secretarial function for Aventura’s existing customers.<\/p>\n<p>Going forward, the parties will together market a joint offering to prospective e-commerce clients, leveraging each other’s capabilities, competitive strengths, and networks.<\/p>\n<p>&#8220;Our customers increasingly require support with reporting and compliance as they expand in China. Through this partnership with Acclime, a leading company in the field, we fulfil our commitments to customers while freeing up capital and resources, which we will reinvest in the fastest growing part of our business: e-commerce operations and related services,&#8221; comments Gustav Åström, CEO of Aventura Group.<\/p>\n<p>&#8220;In markets characterised by increasing sophistication and complexity, our regional network of experts delivers corporate services solutions to the highest global standards. Having worked closely with Aventura on selected client engagements in the past, we are very pleased to formalise our partnership and offer a joint solution to prospective e-commerce clients going forward,” concluded Robin Tabbers, Partner of Acclime China.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Aventura Group AB (Aventura), the China focused e-commerce enabler and brand development company, forms a strategic partnership with Acclime, Asia’s premier corporate services group, to offer joint solutions to e-commerce clients. Aventura Group offers turn-key solutions to international brands seeking to access China’s consumer markets, with a focus on brand management, e-commerce sales and operations. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2787,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4603"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=4603"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/4603\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/2787"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=4603"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=4603"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=4603"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}