{"id":5205,"date":"2022-08-01T12:31:47","date_gmt":"2022-08-01T02:31:47","guid":{"rendered":"https:\/\/www.acclime.com\/?p=5205"},"modified":"2022-08-01T12:31:47","modified_gmt":"2022-08-01T02:31:47","slug":"konundra-acquisition","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/konundra-acquisition\/","title":{"rendered":"Acclime strengthens its transaction advisory services in Singapore with the acquisition of Konundra"},"content":{"rendered":"<p>Asia Pacific’s premier corporate services provider, Acclime, has expanded its Singapore services with the acquisition of boutique corporate advisory firm, Konundra.<\/p>\n<p>Partner and Regional Director of Acclime Indonesia, Malaysia and Singapore, Vinod Kumar, said Konundra’s strong track record in transaction advisory services fits well with Acclime Singapore’s existing services and its need to respond to the increasing popularity of Singapore as an Asia hub. In particular, the acquisition of Konundra increases Acclime’s expertise in IPO and M&amp;A advisory, and strengthens the existing team in areas of CFO, valuation and management services.<\/p>\n<p>“Our strategic acquisition of Konundra enhances Acclime’s transaction advisory services in Singapore at a time when we see an increase in companies seeking to expand their presence here, whether it be through M&amp;A, funding or listing. We are delighted to have Jessie Koh and her team onboard. We worked with Konundra on various engagements in the past before deciding that it is an excellent fit with the Acclime family. Our clients in Singapore and the wider Asia region will now be able to rely on the expertise Jessie and her team brings to the Transaction Advisory space” Mr Kumar said.<\/p>\n<p>Mr Kumar said Acclime will continue to grow organically and through such strategic acquisitions. These enable the group to nurture and develop established, local teams with the added support of an international network, as well as Acclime’s proprietary technology platform enhancing board management capability.<\/p>\n<p>Konundra Business Advisory was founded by Jessie Koh in March 2014 with the passion to help business owners achieve their financial and business objectives. It has set itself apart by offering corporate clients practical roadmaps and faultless execution at attractive price points.<\/p>\n<p>Konundra founder, Jessie Koh, has become a Partner in the Acclime Group, and will now head the Transaction Advisory Services division within Acclime Singapore.<\/p>\n<p>“We are excited to be a part of the Acclime family with whom we share similar core values. Our service offerings in corporate advisory and business valuation complement those of Acclime, and we are now able to tap on their established network as well as considerable resources across Asia. Coming together allows us to serve our clients much better, and more comprehensively.”<\/p>\n<div class=\"uk-margin-top\"><a href=\"https:\/\/singapore.acclime.com\/download\/220801_Press Release_Acclime acquires Konundra.pdf\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"uk-button uk-button-primary\">Download PDF<\/div>\n<p><\/a><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Asia Pacific’s premier corporate services provider, Acclime, has expanded its Singapore services with the acquisition of boutique corporate advisory firm, Konundra. Partner and Regional Director of Acclime Indonesia, Malaysia and Singapore, Vinod Kumar, said Konundra’s strong track record in transaction advisory services fits well with Acclime Singapore’s existing services and its need to respond to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":5206,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/5205"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=5205"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/5205\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/5206"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=5205"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=5205"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=5205"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}