{"id":6099,"date":"2022-10-20T13:25:19","date_gmt":"2022-10-20T06:25:19","guid":{"rendered":"https:\/\/www.acclime.com\/?p=6099"},"modified":"2023-10-30T12:46:37","modified_gmt":"2023-10-30T04:46:37","slug":"mcgi-consultancy","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/mcgi-consultancy\/","title":{"rendered":"Acclime strengthens its presence in Hong Kong via the acquisition of MCGI Consultancy Limited"},"content":{"rendered":"<p>Acclime, the premier corporate services provider in Asia, is delighted to announce that MCGI Consultancy Limited (&#8220;MCGI&#8221;) has completed its integration with the Acclime group. This move brings the headcount of Acclime in Hong Kong to 92, and increases Acclime&rsquo;s engagement by listed companies for company secretarial services in the important Hong Kong market.<\/p>\n<p>MCGI was established in Hong Kong in 2012 by Michael Chan who has over 20 years of professional experience in providing advisory services to listed and multinational clients and real-life commercial experience in organising and executing cross border mergers and acquisitions, equity and debt financing.<\/p>\n<p>MCGI&rsquo;s integration with Acclime is a valuable addition to the company&rsquo;s 900-strong global workforce, which operates in 11 markets in the Asia-Pacific region including China, Hong Kong, Australia, Cambodia, Indonesia, Malaysia, Thailand, India, Philippines, Singapore and Vietnam. Acclime also has offices in the UK, Europe (Amsterdam and Milan) and the USA.<\/p>\n<p>&ldquo;At Acclime, we aspire to become Asia&rsquo;s premier corporate services firm, elevating the standards of corporate governance everywhere we operate. The addition of the MCGI team to Acclime Hong Kong adds significantly to the breadth and depth of expertise in corporate secretarial services for listed companies across Hong Kong, while maintaining our commitment to personalised client care,&rdquo; said Martin Crawford, CEO and Founder of Acclime Group.<\/p>\n<p>&ldquo;We look forward to building a long-term strategic relationship with our clients and contributing our professional knowledge towards Acclime&rsquo;s rapid growth in the time to come. We are pleased to become a part of a larger regional group as it enables us to keep providing our clients with seamless services while offering more support for expansion across Asia.&rdquo; Michael Chan said.<\/p>\n<p>The MCGI team has co-located with Acclime Hong Kong, and the combined team continues to operate seamlessly from Acclime Hong Kong&rsquo;s Admiralty office. MCGI has formally transitioned to the Acclime brand.<\/p>\n<div class=\"uk-margin-top\"><a href=\"\/download\/press-releases\/Acclime-MCGI-Consultancy-Hong-Kong.pdf\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"uk-button uk-button-primary\">Download PDF<\/div>\n<p><\/a><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Acclime is delighted to announce that MCGI Consultancy Limited has completed its integration with the Acclime group in Hong Kong.<\/p>\n","protected":false},"author":1,"featured_media":6104,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6099"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=6099"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6099\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/6104"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=6099"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=6099"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=6099"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}