{"id":6140,"date":"2022-11-17T07:30:05","date_gmt":"2022-11-16T23:30:05","guid":{"rendered":"https:\/\/www.acclime.com\/?p=6140"},"modified":"2023-10-30T12:46:17","modified_gmt":"2023-10-30T04:46:17","slug":"ocra-worldwide-acquisition","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/ocra-worldwide-acquisition\/","title":{"rendered":"Acclime announces strategic acquisition of OCRA Worldwide"},"content":{"rendered":"<p>Asia Pacific&rsquo;s premier corporate services provider, Acclime, announces today that it has completed the strategic acquisition of OCRA Worldwide (OCRA). This is the latest step in Acclime&rsquo;s active expansion as the Asia specialist in compliance and corporate services throughout the region.<\/p>\n<p>Established in 1975 and led by Bart Dekker and Dharmesh Naik, OCRA is one of the industry pioneers in the corporate services sector with a full suite of corporate services from company formation, company secretarial support, accounting and HR services. Over the past 40 years, OCRA has become a truly global business by providing very personalised services to their clients, most of whom are private investors or companies investing abroad.<\/p>\n<p>From its founding base in Europe, OCRA has morphed over the past decade to focus on the faster growing markets of Asia and the Indian Ocean, and currently has teams in Hong Kong, Shanghai, Singapore, Mauritius and the Seychelles with around 80 staff. Additionally, OCRA is licensed in Samoa and the UAE to provide incorporation services to clients and referral partners.<\/p>\n<p>&ldquo;The high quality of the team, the interesting gateway jurisdictions of Mauritius and UAE which are important investment hubs for Africa and India, and the synergy of offering OCRA clients more services and Asian locations for expanding their business were the strategic logic for Acclime&rsquo;s interest in acquiring OCRA,&rdquo; said Martin Crawford, CEO and Co-Founder of Acclime. &ldquo;We look forward to introducing OCRA&rsquo;s corporate clients to our regional experts in China, Hong Kong, Australia, Cambodia, Indonesia, Malaysia, Thailand, India, Philippines, Singapore and Vietnam,&rdquo; he added.<\/p>\n<p>The sale of the business was managed by the deal advisory team of Mazars in London (Paul Joyce, Fred Dearden &amp; Jack Haynes), acting for the ultimate shareholder of OCRA, and was opened for bids. &ldquo;Acclime was chosen as the preferred bidder as the team recognised the cultural similarities, with high quality, personalised services at the core&rdquo; said Bart Dekker, OCRA&rsquo;s Managing Director, Asia Pacific. Dharmesh Naik, OCRA&rsquo;s Managing Director, Middle East and Indian Ocean, added, &ldquo;We are excited and delighted to become an integral part of a large international team with the established resources across Acclime&rsquo;s network, and to execute the transaction in line with OCRA&rsquo;s long term succession plan for the interest of all of our stakeholders.&rdquo;<\/p>\n<p>OCRA will operate as an independent business unit within Acclime, supported by funding, IT and marketing initiatives that will grow the business further. Bart Dekker and Dharmesh Naik will remain running the business post-acquisition.<\/p>\n<p>The transaction is subject to regulatory approvals in several locations and Acclime is expected to complete the acquisition by the end of 2022.<\/p>\n<div class=\"uk-margin-top\"><a href=\"\/download\/press-releases\/Acclime-Acquires-OCRA-Worldwide.pdf\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"uk-button uk-button-primary\">Download PDF<\/div>\n<p><\/a><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Acclime has completed another step in its active expansion across Asia-Pacific with the strategic acquisition of OCRA Worldwide (OCRA).<\/p>\n","protected":false},"author":1,"featured_media":6142,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6140"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=6140"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6140\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/6142"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=6140"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=6140"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=6140"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}