{"id":6566,"date":"2023-06-20T11:39:05","date_gmt":"2023-06-20T03:39:05","guid":{"rendered":"https:\/\/www.acclime.com\/?p=6566"},"modified":"2023-06-20T14:29:12","modified_gmt":"2023-06-20T06:29:12","slug":"ocra-acquisition-complete","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/ocra-acquisition-complete\/","title":{"rendered":"Acclime completes strategic acquisition of Ocra Worldwide"},"content":{"rendered":"<p>Asia Pacific’s premier corporate services provider, Acclime, is pleased to announce the successful completion of all regulatory approvals required for the strategic acquisition of OCRA Worldwide (OCRA). Following the agreement reached between Acclime and OCRA in December of last year, the formalities have now been concluded, and plans for revitalising OCRA are already in progress.<\/p>\n<p>OCRA has long been recognised as a pioneering force in the corporate services sector, offering an extensive range of services, including company formation, company secretarial support, accounting, and HR services. With a focus on tailored solutions for clients, particularly private investors and companies investing abroad, OCRA has earned an outstanding reputation over its impressive 40-year history.<\/p>\n<p>Initially founded in Europe, OCRA has successfully transformed over the past decade to concentrate on the flourishing markets of Asia and the Indian Ocean. Presently, the company has teams based in Hong Kong, Shanghai, Singapore, Mauritius and the Seychelles. Additionally, OCRA holds licenses in Samoa and the UAE, allowing it to provide incorporation services to clients and referral partners. This acquisition by Acclime allows OCRA to transition into a large-scale professional services firm, ensuring continuous access to top talent, an expanded network of seasoned experts, and long-term business sustainability.<\/p>\n<p>Acclime&#8217;s decision to join forces with OCRA was driven by the strategic significance of Mauritius and the UAE as gateway jurisdictions for investments in Africa and India, as well as the exceptional calibre of OCRA&#8217;s team. Both organisations also share cultural and professional similarities and strive to become Asia&#8217;s premier compliance specialists. We firmly believe that OCRA&#8217;s clients will greatly benefit from gaining access to Acclime&#8217;s extensive network of client services across Asia, which includes Greater China, Hong Kong, Australia, Cambodia, Indonesia, Malaysia, Thailand, India, Philippines, Singapore, and Vietnam.<\/p>\n<p>Furthermore, to better cater to clients residing in Taiwan and Dubai, key locations in Acclime&#8217;s long-term strategy, OCRA will be opening branches in these areas in the near future. These new branches will also provide services to clients seeking to establish operations in these markets. The OCRA office in Singapore has already merged with Acclime&#8217;s office, and the Hong Kong office will undergo a similar merger in 2024.<\/p>\n<p>OCRA will continue to operate as an independent business unit within the Acclime Group, led by Bart Dekker and Dharmesh Naik, until early 2024, at which point a full rebranding as Acclime will be considered.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Asia Pacific’s premier corporate services provider, Acclime, is pleased to announce the successful completion of all regulatory approvals required for the strategic acquisition of OCRA Worldwide (OCRA). Following the agreement reached between Acclime and OCRA in December of last year, the formalities have now been concluded, and plans for revitalising OCRA are already in progress. [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":6569,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6566"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=6566"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6566\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/6569"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=6566"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=6566"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=6566"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}