{"id":6600,"date":"2023-07-20T12:56:21","date_gmt":"2023-07-20T04:56:21","guid":{"rendered":"https:\/\/www.acclime.com\/?p=6600"},"modified":"2023-10-30T12:44:52","modified_gmt":"2023-10-30T04:44:52","slug":"vcfo-group-acquisition","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/vcfo-group-acquisition\/","title":{"rendered":"Acclime expands into New Zealand with VCFO Group acquisition"},"content":{"rendered":"<p>Asia&rsquo;s premier corporate services provider, Acclime, has announced its expansion into New Zealand with the strategic acquisition of a leading financial advisory firm, VCFO Group.<\/p>\n<p>Auckland-based VCFO Group has a 17-year history serving a broad base of businesses and investors with virtual CFO services. These include accounting and governance, inbound and outbound investment planning, specialist taxation advisory, and fund administration.<\/p>\n<p>Since VCFO Group&rsquo;s establishment in 2006 as pioneers of virtual CFO services, it has developed a strong marketplace brand and presence. This follows from consistent reputational business growth, including the addition of other practices, notably and most recently, Milne Maingay Chartered Accountants. VCFO Group currently has a team of 55 dedicated professionals.<\/p>\n<p>Acclime Co-Founder and CEO, Martin Crawford, has identified New Zealand as a significant incubator for innovation and a destination for foreign investment, and its trading relationships with its Australian and Asian neighbours are mutually advantageous. Speaking about the new merger, he said:<\/p>\n<p>&ldquo;The team at VCFO Group are trusted advisors to more than 1,200 clients, working closely with them to navigate New Zealand&rsquo;s regulatory markets and achieve their growth aspirations.<\/p>\n<p>&ldquo;This strategic merger is a natural fit for what we do at Acclime &ndash; guiding and supporting our clients as they expand and succeed in Asia Pacific markets. It also allows VCFO Group&rsquo;s clients to integrate with our established operational network across the Asia Pacific region, and leverage our UK, US, and European offices.<\/p>\n<p>&ldquo;We&rsquo;re delighted to welcome the VCFO Group along with all their highly accomplished professionals into the Acclime fold.&rdquo;<\/p>\n<p>VCFO Group has also developed a niche specialisation in the screen and entertainment industry, becoming New Zealand&rsquo;s pre-eminent service provider for international and domestic film and television productions. Its &lsquo;one-stop-shop&rsquo; full life cycle service offerings<\/p>\n<p>cover everything from structural set-up to maximising NZ&rsquo;s screen incentive rebate to industry-specific taxation and production accounting requirements.<\/p>\n<p>VCFO Group&rsquo;s Director Randolph van der Burgh says the company is enthusiastic about the merger and looking forward to the expertise and support Acclime will provide.<\/p>\n<p>&ldquo;We are ourselves a growing practice, and this integration with Acclime represents the logical next step in our journey, offering huge opportunities for our people and our clients,&rdquo; Mr van der Burgh said.<\/p>\n<p>&ldquo;Already, we are seeing benefits from our association with Acclime, with new referrals and service line support within our funds administration service and our new Employer of Record offering. In turn, we are providing our film production and entertainment experience and networks to Acclime Australia.<\/p>\n<p>&ldquo;This integration with the Acclime Group network of partners and staff has the complete support of VCFO&rsquo;s director group. We are genuinely excited to be joining Acclime&rsquo;s extensive Asia Pacific presence delivering first class corporate and advisory services. The two-way client service and business growth opportunities ahead are exhilarating. This is a great fit.&rdquo;<\/p>\n<div class=\"uk-margin-top\"><a href=\"\/download\/press-releases\/Acclime-Acquires-VCFO-Group.pdf\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"uk-button uk-button-primary\">Download PDF<\/div>\n<p><\/a><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Asia&rsquo;s premier corporate services provider, Acclime, has announced its expansion into New Zealand with the strategic acquisition of a leading financial advisory firm, VCFO Group. Auckland-based VCFO Group has a 17-year history serving a broad base of businesses and investors with virtual CFO services. These include accounting and governance, inbound and outbound investment planning, specialist [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":6603,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6600"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=6600"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6600\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/6603"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=6600"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=6600"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=6600"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}