{"id":6648,"date":"2023-08-29T10:52:59","date_gmt":"2023-08-29T02:52:59","guid":{"rendered":"https:\/\/www.acclime.com\/?p=6648"},"modified":"2023-10-30T12:40:48","modified_gmt":"2023-10-30T04:40:48","slug":"rsm-hong-kong","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/rsm-hong-kong\/","title":{"rendered":"Acclime acquires the non-audit arm of RSM Hong Kong"},"content":{"rendered":"<p>Acclime, Asia’s premier corporate services specialist, has completed the acquisition of RSM Hong Kong’s non-audit practice in a landmark deal that will significantly enhance Acclime’s scale and advisory services capabilities. This move reflects a growing trend among leading professional firms to segregate their audit and advisory divisions – a shift that will become mandatory for the “Big 4” in the United Kingdom in 2024 – and signifies the first transaction of scale of its kind in Asia.<\/p>\n<p>On 31 July 2023, as the result of a restructuring to establish operational independence between its assurance and non-assurance operations, RSM Hong Kong left the RSM International network of member firms.<\/p>\n<p>The audit and IT consulting divisions of RSM Hong Kong remain together and became a correspondent firm of RSM International on 24 August 2023. The firm will be adopting a new brand name shortly.<\/p>\n<p>The non-audit division has been acquired by Acclime and will operate under the Acclime Advisory Services brand. This division employs approximately 150 individuals and offers taxation, risk advisory, transaction advisory, and corporate advisory services to local and international clients.<\/p>\n<p>Martin Crawford, Co-Founder and CEO of Acclime, said the acquisition puts Acclime ‘firmly on the map’ in advisory services and will propel the development of Acclime as a fully-fledged professional services firm across Asia.<\/p>\n<p>Established in 2019, Acclime operates in 14 markets in the Asia-Pacific region with more than 13,000 active clients and over 1,100 staff.<\/p>\n<p>“Our strategic acquisition of the firm’s non-audit business builds scale and access within Acclime’s international portfolio, turbo-charging our tax practice and expanding our service line capabilities to include transaction advisory, risk advisory, and restructuring services,” Mr Crawford said. “Accordingly, we have created a new division within the group to foster this talent and service offering, Acclime Advisory Services, which will maintain a close working relationship with its former audit counterpart. We are looking to other Asian markets to grow our advisory business”.<\/p>\n<p>Mr Crawford noted that the acquisition boosts Acclime’s overall business size by around 30 per cent and follows several tactical acquisitions in recent months, including advisory firms VCFO Milne Maingay Group in New Zealand and The CFO Solution in Australia.<\/p>\n<p>Mr Eric Chen, newly appointed Managing Partner of Acclime Advisory Services and Head of the Tax Division, expressed that the professional services landscape is evolving rapidly, with regulatory changes and market demands driving firms to innovate and adapt. “Our future focus will be on building a borderless pan-Asian advisory firm free from the constraints of client conflict. Clients will benefit from Acclime’s expanded suite of services and technology tools. The whole team is very excited.”<\/p>\n<p>The undertaking represents the first major CPA practice to separate its auditing arms in Asia.<\/p>\n<h3>About former RSM Hong Kong<\/h3>\n<p>The former RSM Hong Kong was founded in 1975 and stands as a prominent accounting and consulting firm. It provides an extensive array of services to clients both in Hong Kong and on an international scale. Previously a member of RSM International, the global network of independent professional firms, RSM Hong Kong has undergone restructuring. The advisory arm was acquired by Acclime and will operate as Acclime Advisory Services, while the audit and IT consulting divisions will operate as a correspondent firm of RSM International. For more detailed information, please refer to <a href=\"https:\/\/www.rsm.global\/hongkong\/en\" target=\"_blank\" rel=\"noopener\">www.rsm.global\/hongkong\/en<\/a>.<\/p>\n<div class=\"uk-margin-top\"><a class=\"uk-button uk-button-primary\" href=\"https:\/\/www.acclime.com\/download\/press-releases\/Acclime-acquires-the%20non-audit-arm-of-RSM-Hong-Kong.pdf\" target=\"_blank\" rel=\"noopener\">Download PDF<\/a><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Acclime, Asia’s premier corporate services specialist, has completed the acquisition of RSM Hong Kong’s non-audit practice in a landmark deal that will significantly enhance Acclime’s scale and advisory services capabilities. This move reflects a growing trend among leading professional firms to segregate their audit and advisory divisions – a shift that will become mandatory for [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":6104,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6648"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=6648"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6648\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/6104"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=6648"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=6648"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=6648"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}