{"id":6692,"date":"2023-09-04T10:08:34","date_gmt":"2023-09-04T02:08:34","guid":{"rendered":"https:\/\/www.acclime.com\/?p=6692"},"modified":"2023-10-30T12:40:10","modified_gmt":"2023-10-30T04:40:10","slug":"ed-novak-new-managing-director-for-north-america","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/ed-novak-new-managing-director-for-north-america\/","title":{"rendered":"Acclime appoints Ed Novak as new Managing Director for North America"},"content":{"rendered":"<p>Acclime, Asia-Pacific’s leading tech-enabled professional services provider, is proud to announce the appointment of Ed Novak as the firm’s Managing Director, North America. Ed will lead Acclime’s US-based Client Service Centre, advising clients from North America on the best ways to leverage Acclime’s teams throughout Asia and Oceania. The appointment highlights Acclime’s commitment to providing global-standard professional services in the Asia-Pacific region for clients from around the world.<\/p>\n<p>Ed brings extensive leadership experience to Acclime’s North American operations, having held significant roles in the technology and professional services sectors, including at IBM, PwC, Amdocs, Grant Thornton, and Radius\/Vistra.<\/p>\n<p>Blair Lucas, Acclime’s Group Commercial Director, noted, “Ed’s particular skill set lies in supporting companies in North America to fulfil their growth strategies as they expand internationally. Ed built and led teams that delivered successful paths to global growth, and I have strong confidence in his ability to deliver meaningful results for Acclime’s North American clients.”<\/p>\n<p>Ed shared Blair’s enthusiasm and confidence, stating, “I am thrilled to begin this new role, and I look forward to both managing a high-performance client support team and cultivating sustainable relationships with collaborative referral partners. As more and more companies invest in Asia-Pacific growth strategies, I am eager to leverage the Acclime advisory and corporate services platform for their benefit.”<\/p>\n<p>Acclime’s CEO, Martin Crawford, put Ed’s appointment into perspective by adding, “The US is one of the largest FDI investors into Asia and the largest in the ASEAN bloc. Acclime’s mission is to help these companies navigate into and throughout these markets with our on-the-ground operations, backed by an expert team in their own time zone in the USA. Ed’s experience as an international expansion specialist will make him and his team the go-to experts for any US company or investor targeting expansion in the Asia-Pacific market.”<\/p>\n<p>With Ed Novak leading the North American operation, Acclime continues on an exciting path of bolstering its tech capabilities to embrace enhanced digitisation, AI integration, and the delivery of exceptional corporate services. Acclime will be counting on Ed’s expertise to further strengthen its ability to deliver seamless cross-cultural integration for North American businesses in the Asia-Pacific.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Acclime, Asia-Pacific’s leading tech-enabled professional services provider, is proud to announce the appointment of Ed Novak as the firm’s Managing Director, North America. Ed will lead Acclime’s US-based Client Service Centre, advising clients from North America on the best ways to leverage Acclime’s teams throughout Asia and Oceania. The appointment highlights Acclime’s commitment to providing [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":6693,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6692"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=6692"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6692\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/6693"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=6692"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=6692"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=6692"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}