{"id":6903,"date":"2023-12-05T09:00:43","date_gmt":"2023-12-05T01:00:43","guid":{"rendered":"https:\/\/www.acclime.com\/?p=6903"},"modified":"2023-12-04T18:03:52","modified_gmt":"2023-12-04T10:03:52","slug":"acclime-appoints-miguel-latorre-hong-kong-managing-director","status":"publish","type":"post","link":"https:\/\/www.acclime.com\/press-release\/acclime-appoints-miguel-latorre-hong-kong-managing-director\/","title":{"rendered":"Acclime appoints Miguel Latorre as Hong Kong Managing Director"},"content":{"rendered":"<p>Acclime, the leading tech-enabled professional services provider in the Asia-Pacific region, is pleased to announce the appointment of Miguel Latorre as the Managing Director of Hong Kong, effective immediately. With over 19 years of experience and a proven track record in facilitating business expansion across Southeast Asia, Miguel will further strengthen Acclime&#8217;s commitment to serving clients in the region.<\/p>\n<p>&#8220;Miguel&#8217;s extensive knowledge of the Indonesian and Southeast Asian markets, along with his international expertise and leadership abilities, make him a valuable addition to our team,&#8221; says Martin Crawford, CEO of Acclime. &#8220;Under his guidance, we will enhance our presence and capabilities in Hong Kong, serving as the gateway for North Asian companies to thrive in Southeast Asia.&#8221;<\/p>\n<p>Before joining Acclime, Miguel held the position of Managing Director at VISTRA for Indonesia and Malaysia, where he led the Commercial Corporates team across Southeast Asia. He is also the founder of Global Expandia, a market-entry firm specialising in Indonesia, which was later acquired by VISTRA, demonstrating his entrepreneurial spirit and market acumen.<\/p>\n<p>Miguel&#8217;s career has taken him across Europe and Asia, with a strong focus on the Asia-Pacific region. He has worked in Spain, Scotland, Germany, Belgium, Australia, and, notably, Indonesia. His diverse professional background gives him a unique understanding of the intricacies of international expansion and the challenges businesses face entering new markets.<\/p>\n<p>As a native Spanish speaker, Miguel is fluent in English and proficient in Bahasa Indonesia. His linguistic abilities, combined with his basic working knowledge of German and Italian, enable him to seamlessly connect with clients and colleagues from diverse backgrounds, fostering an inclusive and collaborative environment.<\/p>\n<p>&#8220;I am thrilled to join Acclime&#8217;s dynamic team and contribute to the firm&#8217;s continued success in Southeast Asia,&#8221; says Miguel. &#8220;My passion lies in helping businesses navigate the complexities of international expansion and unlock the immense potential of the region. I look forward to working closely with our clients to achieve their growth goals and build enduring partnerships.&#8221;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Acclime is pleased to announce the appointment of Miguel Latorre as the Managing Director of Hong Kong, effective immediately. <\/p>\n","protected":false},"author":1,"featured_media":6907,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[97],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6903"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/comments?post=6903"}],"version-history":[{"count":0,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/posts\/6903\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/6907"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=6903"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/categories?post=6903"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/tags?post=6903"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}