{"id":6797,"date":"2023-06-30T10:48:14","date_gmt":"2023-06-30T02:48:14","guid":{"rendered":"https:\/\/www.acclime.com\/?post_type=events&#038;p=6797"},"modified":"2023-11-20T17:46:49","modified_gmt":"2023-11-20T09:46:49","slug":"withholding-tax-fundamentals","status":"publish","type":"events","link":"https:\/\/www.acclime.com\/events\/withholding-tax-fundamentals\/","title":{"rendered":"Singapore withholding tax fundamentals: A practical guide"},"content":{"rendered":"<p>Join us for an engaging webinar by Acclime Singapore as we delve into the essential aspects of withholding tax in Singapore. Our tax team will bring you technical and practical insight into the Singapore withholding tax regime and how to stay compliant with all your withholding tax requirements.<\/p>\n<p>Withholding tax is a mechanism to collect income tax for non-residents&#8217; payments, which businesses often overlook. With the rise of cross-border transactions, the responsibility of the withholding tax deduction and accountability lies with the Singapore businesses making payments to non-residents. Therefore, it is crucial for businesses to understand the practical application of withholding and to avoid potential non-compliance penalties.<\/p>\n<p>This workshop is designed to give accounting professionals practical knowledge on withholding tax in Singapore, learn about the concept of a permanent establishment, and understand specific articles in the Double Tax Agreements.<\/p>\n<h3>Webinar outline<\/h3>\n<ol>\n<li>Overview of the withholding tax system in Singapore<\/li>\n<li>Transactions that are subject to withholding tax:\n<ul>\n<li>Interest<\/li>\n<li>Royalties, technical fees, management fees<\/li>\n<li>Software payments and digital goods<\/li>\n<\/ul>\n<\/li>\n<li>Withholding tax rates<\/li>\n<li>Application of tax treaties<\/li>\n<li>Withholding tax compliance and administration in Singapore<\/li>\n<li>Case study<\/li>\n<\/ol>\n<h3>Speakers<\/h3>\n<h4>Thomas Chan, Partner, Managing Director Acclime Singapore<\/h4>\n<p>Thomas has over 20 years of experience in big 4 firms advising clients in Singapore, Australia, Indonesia and Myanmar. More recently, Thomas has been advising his clients on investing into the region via Singapore and providing his clients with practical solutions based on his local understanding of the regulatory and business environment. As such, his clients come from a broad range of different sectors – from financial services and real estate to healthcare and industrials. The investments that his clients make may be greenfield or acquisitions of stable and mature businesses. His clients look to him as a business partner in strategising their entry into markets; bringing fresh insights into the Singapore business environment.<\/p>\n<h4>Patrick Jeganathan, Tax Manager Acclime Singapore<\/h4>\n<p>Patrick has over 10 years of experience in taxation, including practical, research and editorial expertise in areas of corporate taxation, individual taxation and cross border taxation. Previously he was attached to the International Bureau of Fiscal Documentation (IBFD) where he focused on tax research and report writing, covering such topics as Base Erosion and Profit Shifting (BEPS), tax treaties and cross-border taxation.<\/p>\n","protected":false},"featured_media":6798,"template":"","acf":[],"_links":{"self":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/event\/6797"}],"collection":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/event"}],"about":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/types\/events"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media\/6798"}],"wp:attachment":[{"href":"https:\/\/www.acclime.com\/wp-json\/wp\/v2\/media?parent=6797"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}